ModifyEvent(-2, 82, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 16, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 27, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
jyx2_ReplaceSceneObject("", "NPC/黑木崖弟子/NPC16", "");
jyx2_ReplaceSceneObject("", "NPC/黑木崖弟子/NPC27", "");
ModifyEvent(-2, 87, 0, 0, -1, -1, 322, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本322， 场景26-编号87
ModifyEvent(-2, 88, 0, 0, -1, -1, 322, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本322， 场景26-编号88
ModifyEvent(-2, 89, 0, 0, -1, -1, 322, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本322， 场景26-编号89
ModifyEvent(-2, 90, 0, 0, -1, -1, 322, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本322， 场景26-编号90
ModifyEvent(-2, 91, 0, 0, -1, -1, 322, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本322， 场景26-编号91
ModifyEvent(-2, 92, 0, 0, -1, -1, 322, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本322， 场景26-编号92
ModifyEvent(-2, 93, 0, 0, -1, -1, 322, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本322， 场景26-编号93
ModifyEvent(-2, 56, 1, 1, -1, -1, -1, 5964, 5964, 5964, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号56
ModifyEvent(-2, 57, 1, 1, -1, -1, -1, 5956, 5956, 5956, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号57
ModifyEvent(-2, 58, 1, 1, -1, -1, -1, 5940, 5940, 5940, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号58
ModifyEvent(-2, 59, 1, 1, -1, -1, -1, 5948, 5948, 5948, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号59
ModifyEvent(-2, 60, 1, 1, -1, -1, -1, 5972, 5972, 5972, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号60
ModifyEvent(-2, 61, 1, 1, -1, -1, -1, 5208, 5208, 5208, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号61
ModifyEvent(-2, 62, 1, 1, -1, -1, -1, 5208, 5208, 5208, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号62
ModifyEvent(-2, 63, 1, 1, -1, -1, -1, 5208, 5208, 5208, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号63
ModifyEvent(-2, 64, 1, 1, -1, -1, -1, 5208, 5208, 5208, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号64
ModifyEvent(-2, 65, 1, 1, -1, -1, -1, 5208, 5208, 5208, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号65
ModifyEvent(-2, 66, 1, 1, -1, -1, -1, 5208, 5208, 5208, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号66
ModifyEvent(-2, 67, 1, 1, -1, -1, -1, 5192, 5192, 5192, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号67
ModifyEvent(-2, 68, 1, 1, -1, -1, -1, 5192, 5192, 5192, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号68
ModifyEvent(-2, 69, 1, 1, -1, -1, -1, 5192, 5192, 5192, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号69
ModifyEvent(-2, 70, 1, 1, -1, -1, -1, 5184, 5184, 5184, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号70
ModifyEvent(-2, 71, 1, 1, -1, -1, -1, 5184, 5184, 5184, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号71
ModifyEvent(-2, 72, 1, 1, -1, -1, -1, 5184, 5184, 5184, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号72
ModifyEvent(-2, 73, 1, 1, -1, -1, -1, 5200, 5200, 5200, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号73
ModifyEvent(-2, 74, 1, 1, -1, -1, -1, 5200, 5200, 5200, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号74
ModifyEvent(-2, 75, 1, 1, -1, -1, -1, 5200, 5200, 5200, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号75
ModifyEvent(-2, 76, 1, 1, -1, -1, -1, 5176, 5176, 5176, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号76
ModifyEvent(-2, 77, 1, 1, -1, -1, -1, 5176, 5176, 5176, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号77
ModifyEvent(-2, 78, 1, 1, -1, -1, -1, 5176, 5176, 5176, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号78
ModifyEvent(-2, 79, 1, 1, -1, -1, -1, 5176, 5176, 5176, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号79
ModifyEvent(-2, 80, 1, 1, -1, -1, -1, 5176, 5176, 5176, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号80
ModifyEvent(-2, 81, 1, 1, -1, -1, -1, 5176, 5176, 5176, -2, -2, -2);--by fanyu 改变贴图， 场景26-编号81
jyx2_ReplaceSceneObject("","NPC/五岳剑派掌门","1");
jyx2_ReplaceSceneObject("","NPC/五岳剑派弟子","1");
do return end;
