Talk(0, "请问这位师父，这里就是少林寺吗？", "talkname0", 1);
Talk(96, "正是。", "talkname96", 0);
Talk(0, "少林寺耶！武学的殿堂，武侠小说中绝对少不了的场景，赶紧进去看一看。", "talkname0", 1);
Talk(96, "方丈率寺中弟子，与其余五大派共同围攻光明顶去了，至今未回。请施主下山。", "talkname96", 0);
ModifyEvent(-2, 3, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-3
ModifyEvent(-2, 4, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-4
ModifyEvent(-2, 5, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-5
ModifyEvent(-2, 6, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-6
do return end;
