Talk(0, "乔帮主，我听别人说，《天龙八部》一书是在丐帮手中，此事当真？", "talkname0", 1);
Talk(50, "没错。", "talkname50", 0);
Talk(0, "还请乔帮主能借我此书，因为此书关系到我的未来。", "talkname0", 1);
Talk(50, "少侠可知我丐帮的绝技？", "talkname50", 0);
Talk(0, "素闻丐帮“降龙十八掌”威猛凌厉，是天下掌法第一。", "talkname0", 1);
Talk(50, "是的。因为我丐帮与这“龙”字有点缘份，所以本帮的前辈在当时就取得了十四天书中的《天龙八部》，当做镇帮之宝留传至今，并引以为傲。我乔峰身为丐帮帮主，你说，我怎么将它给你呢。", "talkname50", 0);
Talk(0, "这……", "talkname0", 1);
Talk(50, "不过，这事也并不是无解。因为此书原来的主人并不是丐帮，所以我也不会强占。当初本帮曾定下规矩，若有人能打嬴丐帮的“降龙十八掌”，他就比丐帮更有资格拥有此书。", "talkname50", 0);
Talk(0, "你是说……", "talkname0", 1);
Talk(50, "只要你凭一己之力，能打败我乔峰，丐帮必当无条件奉上《天龙八部》一书。你准备好时就跟我说一声。", "talkname50", 0);
ModifyEvent(-2, -2, -2, -2, 528, -2, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本528 场景51-14
do return end;
