ModifyEvent(-2, 5, -2, -2, 630, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动630脚本。场景16-编号5
ModifyEvent(-2, 6, -2, -2, 630, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动630脚本。场景16-编号6
ModifyEvent(-2, 7, -2, -2, 630, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动630脚本。场景16-编号7
ModifyEvent(-2, 8, -2, -2, 630, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动630脚本。场景16-编号8
ModifyEvent(-2, 9, -2, -2, 630, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动630脚本。场景16-编号9
ModifyEvent(-2, 10, -2, -2, 630, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动630脚本。场景16-编号10
ModifyEvent(-2, 11, -2, -2, 630, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动630脚本。场景16-编号11
ModifyEvent(-2, 20, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 21, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 22, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
do return end;
