Talk(0, "咦！你們四人怎麼會在這？", "talkname0", 1);
Talk(73, "少年人，恭喜你．歷經千辛萬苦，你總算走到這了．證明你的修行有了結果．", "talkname73", 0);
Talk(74, "年輕人，我給你的提示還有用吧．", "talkname74", 0);
Talk(75, "怎麼，還想吃我林廚子做的菜嗎？還是想趕緊回到家裡吃媽媽親手燒的菜呢？", "talkname75", 0);
Talk(72, "我孔八拉真的服了你．連十大高手聯手都不是你的對手．真有你的．這”武林神杖”還你，你擁有它才是實至名歸．", "talkname72", 0);
Talk(0, "你們四人是．．．", "talkname0", 1);
Talk(74, "你不覺得我們四人非常奇怪嗎？", "talkname74", 0);
Talk(0, "是有這麼一點．．．尤其是．．．", "talkname0", 1);
Talk(72, "尤其是我孔八拉吧！", "talkname72", 0);
Talk(0, "沒錯，怪不倫不類的．你們究竟是誰？", "talkname0", 1);
Talk(75, "我們是”群俠”之外的人．也就是說，是這遊戲世界外的人．", "talkname75", 0);
Talk(72, "其實我們有個外號叫做”遊戲界的四大天王”．而我們的總頭目就是你家裡面的”軟體娃娃”．這樣說你了解了吧．", "talkname72", 0);
Talk(0, "哦！原來你們是．．．．", "talkname0", 1);
Talk(73, "好了，不擔誤你寶貴的時間了．再往下走就是遊戲盡頭了．我們幾人是奉總頭目之命前來為你送行的，並且轉告幾句話給你．希望這個遊戲能讓你玩的高興，快樂．享受到一個玩者該有的歡樂．但如果沒有的話，也希望你能來信給我們指教，指出我們沒有注意到的地方．這樣我們下次才能改進，以達到你的要求．另外，本遊戲的”外傳”也正在製作中，希望短期內能與你們見面，到時搞不好你又是”最幸運”的消費者．不過這還得靠你們多多支持才是，請來信賜教及鼓勵．", "talkname73", 0);
DarkScence();
ModifyEvent(-2, 35, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 36, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 37, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 38, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
jyx2_ReplaceSceneObject("", "NPC/nanxian", "");--南贤离开
jyx2_ReplaceSceneObject("", "NPC/beichou", "");--北丑离开
jyx2_ReplaceSceneObject("", "NPC/chushi", "");--厨师离开
jyx2_ReplaceSceneObject("", "NPC/kongbala", "");--孔巴拉离开
LightScence();
Talk(0, "這會真的都沒人了，那我可要回家了！", "talkname0", 1);
GetItem(143, 1);
ModifyEvent(-2, 6, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 7, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 8, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 9, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
do return end;
