Talk(31, "三哥，就是這傢伙．", "talkname31", 0);

Talk(32, "看少俠年紀輕輕，想不到武功竟能夠凌駕我四弟之上，真是英雄出少年．", "talkname32", 0);
Talk(0, "不敢當，想必閣下是三莊主禿筆翁？", "talkname0", 1);
Talk(32, "正是老夫．", "talkname32", 0);
Talk(31, "三哥，你一定要幫我出這口氣，將那幅”谿山行旅圖”給搶過來．", "talkname31", 0);
Talk(32, "四弟，你自己丟的面子還不夠啊！這位少俠，老夫不送了．", "talkname32", 0);
ModifyEvent(-2, 6, -2, -2, 252, 253, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 7, -2, -2, 252, 253, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 8, -2, -2, 280, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
