Talk(0, "請問一下，你們鑣局不做生意了嗎？怎麼沒半個人影．小爺我有些珍貴的寶物還想找你們保呢！", "talkname0", 1);
Talk(36, "這位公子，非常抱歉，今天本鑣局不做生意．", "talkname36", 0);
Talk(0, "開了鑣局卻不做生意，你這”福威鑣局”的招牌是掛假的啊！叫你們總鑣頭出來．", "talkname0", 1);
Talk(36, "說不保鑣就不保鑣，你在這大呼小叫個什麼勁．", "talkname36", 0);
if TryBattle(48) == true then goto label0 end;
    Dead();
    do return end;
::label0::
    LightScence();
    Talk(0, "我看福威鑣局的武功也稀鬆平常，鑣還是不要給你們保比較妥當．", "talkname0", 1);
    Talk(36, "哼！要不是我福威鑣局被青城派的人大舉入侵，家父被抓，家母被殺，其他的鑣師死的死，逃的逃，否則．．．．．", "talkname36", 0);
    Talk(0, "這麼慘？你們是走失了人家的鑣，還是怎麼樣得罪了青城派．", "talkname0", 1);
    Talk(36, "聽我父親說，先祖林遠圖曾打敗過青城派掌門長青子，所以今天他們是來報復的．", "talkname36", 0);
    Talk(0, "怎麼如此可惡，小爺我看不過去了．", "talkname0", 1);
    Talk(36, "少俠武功高強，請少俠幫我救出家父，我林平之這輩子願做牛做馬服侍你．若少俠願意幫忙，我福威鏢局中的任何物品，少俠都可隨意取用．這其中還包括了一本”松風劍譜”，是我從青城派那幾個小賊身上偷來的．想研究看看他們的劍招上是不是有什麼破綻．", "talkname36", 0);
    Talk(0, "說這麼多做什麼，我就幫你上青城派看看好了．", "talkname0", 1);
    ModifyEvent(-2, -2, -2, -2, 298, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 2, -2, -2, -1, -1, 299, -2, -2, -2, -2, -2, -2);
    if JudgeEventNum(3, -1) == true then goto label1 end;
        ModifyEvent(-2, 3, -2, -2, 948, -1, -1, -2, -2, -2, -2, -2, -2);
::label1::
        if JudgeEventNum(4, -1) == true then goto label2 end;
            ModifyEvent(-2, 4, -2, -2, 949, -1, -1, -2, -2, -2, -2, -2, -2);
::label2::
            ModifyEvent(36, 0, -2, -2, 293, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(36, 1, -2, -2, 293, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(36, 2, -2, -2, 293, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(36, 3, -2, -2, 293, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(36, 4, -2, -2, 295, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(1, 11, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(1, 12, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(1, 13, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(1, 14, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            AddRepute(1);
            ChangeMMapMusic(3);
do return end;
