Talk(86, "大俠別殺我，我是”青城四秀”中的侯人雄．．．", "talkname86", 0);
Talk(0, "你這頭狗熊，想幹什麼，憑什麼要我不殺你．", "talkname0", 1);
Talk(86, "我知道個秘密．", "talkname86", 0);
Talk(0, "你說．", "talkname0", 1);
Talk(86, "林震南死前曾要我轉告他兒子．．．”福州向陽巷老宅地窖中的物事，是林家祖傳之物，須得好好保管．．．．但他曾祖遠圖公留有遺訓，林家子孫，不得翻看，否則後患無窮．”這事我連師父也沒說，說出來給少俠參考．", "talkname86", 0);
Talk(0, "好，不錯，這訊息似乎有點用處，我就放過你．", "talkname0", 1);
Talk(86, "謝謝少俠，少俠這麼好心，將來一定娶個美嬌娘．", "talkname86", 0);
Talk(0, "這話聽來還蠻舒服的．你本質還不壞，別跟著這壞人了，快回家種田去吧．", "talkname0", 1);
Talk(86, "是．．是 ．．．", "talkname86", 0);
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
jyx2_ReplaceSceneObject("", "NPC/hourenxiong", "");-- 移除人物
ModifyEvent(56, 1, -2, -2, 289, -1, -1, -2, -2, -2, -2, -2, -2);
DarkScence();
LightScence();
do return end;
