Talk(19, "少俠，老夫聽說你獨自攻上這黑木崖來，特別率我五嶽派門徒趕上來幫你．東方不敗那魔頭呢？", "talkname19", 0);
Talk(0, "唉！你們怎麼跟電影劇情一樣，事情都結束後才出現．東方不敗那個變態傢伙，已經被我”幹掉”了．", "talkname0", 1);
Talk(19, "真是如此！少俠又替我武林正派立了一項大功．", "talkname19", 0);
Talk(0, "那裡，那裡．", "talkname0", 1);
Talk(19, "那不知少俠是否有看到一本書？", "talkname19", 0);
Talk(0, "什麼書？", "talkname0", 1);
Talk(19, "”笑傲江湖”！", "talkname19", 0);
Talk(0, "當然有啊！我辛苦了半天，還不都是為了它．任老頭將它送給我了．", "talkname0", 1);
Talk(19, "這又是另一項功勞了．少俠真當為我武林同道所敬仰．此書乃是我五嶽劍派許多前輩當年拼命所得到的，後來不幸被魔教奪去．我五嶽派這幾年發奮圖強，與魔教周旋到底，為的就是將此書奪回．想不到今日少俠大顯神威，從魔教手中將此書奪回，我五嶽派全體上下無限感激．現在就請少俠將此書還與我五嶽派．", "talkname19", 0);
Talk(0, "＜說了半天，原來也是想要  ”笑傲江湖”這本書＞不過據我所知，這本書的原主人也不是五嶽劍派的人．你們前輩只是暫時得到過．今天，我的任務就是要將這些書送回原處，你們以後也不用再為此煩心．更何況這書也不是你們想像中的什麼高深武功秘笈，它只不過是本故事書罷了．", "talkname0", 1);
Talk(19, "莫非，少俠是想將此書佔為己有．還是你已與魔教勾結了？", "talkname19", 0);
Talk(0, "岳先生，你別給我亂安罪名了．這書真的不是你們想像中的什麼高深武功秘笈，它只不過是本故事書罷了．", "talkname0", 1);
Talk(19, "看來少俠入魔已深，非得要逼我們動手不可．", "talkname19", 0);
Talk(0, "我看是你岳不群入魔已深．那日嵩山大會上我就有點被”耍”的感覺．今天，你為了搶這本”笑傲江湖”又想不擇手段．今日你怎會突然出現，分明就是早已算計好的，想等我跟東方不敗鶴蚌相爭，你好來個漁翁得利．我看你不是”君子劍”，分明是個”偽君子”！", "talkname0", 1);
Talk(19, "你．．．你說什麼！", "talkname19", 0);
if InTeam(35) == false then goto label0 end;
    Talk(35, "師父，別再執迷下去了．這書的確不是武功秘笈，只是一本普通的書．", "talkname35", 1);
::label0::
    Talk(0, "岳先生，回頭是岸．", "talkname0", 1);
    Talk(19, "別說這麼多的廢話，五嶽派的人聽著，給我殺，今日不留一個活口．", "talkname19", 0);
    if TryBattle(56) == true then goto label1 end;
        Dead();
        do return end;
::label1::
        ModifyEvent(-2, 61, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号61
        ModifyEvent(-2, 62, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号62
        ModifyEvent(-2, 63, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号63
        ModifyEvent(-2, 64, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号64
        ModifyEvent(-2, 65, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号65
        ModifyEvent(-2, 66, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号66
        ModifyEvent(-2, 67, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号67
        ModifyEvent(-2, 68, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号68
        ModifyEvent(-2, 69, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号69
        ModifyEvent(-2, 70, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号70
        ModifyEvent(-2, 71, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号71
        ModifyEvent(-2, 72, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号72
        ModifyEvent(-2, 73, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号73
        ModifyEvent(-2, 74, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号74
        ModifyEvent(-2, 75, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号75
        ModifyEvent(-2, 76, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号76
        ModifyEvent(-2, 77, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号77
        ModifyEvent(-2, 78, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号78
        ModifyEvent(-2, 79, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号79
        ModifyEvent(-2, 80, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号80
        ModifyEvent(-2, 81, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号81
        ModifyEvent(-2, 83, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号83
        ModifyEvent(-2, 84, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号84
        ModifyEvent(-2, 85, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号85
        LightScence();
        Talk(0, "五嶽派的各位，今日多有冒犯之處，請多包涵．", "talkname0", 1);
        Talk(19, "哼！我們走．", "talkname19", 0);
        DarkScence();
        ModifyEvent(-2, 56, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号56
        ModifyEvent(-2, 57, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号57
        ModifyEvent(-2, 58, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号58
        ModifyEvent(-2, 59, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号59
        ModifyEvent(-2, 60, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号60
        LightScence();
        Talk(0, "想不到在找尋這本書的過程中，讓我看到人性中為了爭權奪利所展現的醜陋面．不管是正派中的左冷禪與岳不群，還是邪派中的任我行與東方不敗，都是一樣的．", "talkname0", 1);
        ModifyEvent(-2, 87, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号87
        ModifyEvent(-2, 88, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号88
        ModifyEvent(-2, 89, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号89
        ModifyEvent(-2, 90, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号90
        ModifyEvent(-2, 91, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号91
        ModifyEvent(-2, 92, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号92
        ModifyEvent(-2, 93, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 战斗结束，移除敌人， 场景26-编号93
        ModifyEvent(31, 0, -2, -2, 329, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本329， 场景31-编号0
        ModifyEvent(31, 1, -2, -2, 329, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本329， 场景31-编号1
        ModifyEvent(29, 0, -2, -2, 330, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本330， 场景29-编号0
        ModifyEvent(29, 1, -2, -2, 330, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本330， 场景29-编号1
        ModifyEvent(58, 10, -2, -2, 331, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本331， 场景58-编号10
        ModifyEvent(58, 11, -2, -2, 331, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本331， 场景58-编号11
        ModifyEvent(57, 0, -2, -2, 332, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本332， 场景57-编号0
        ModifyEvent(57, 1, -2, -2, 332, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本332， 场景57-编号1
        AddRepute(12);
do return end;
