ModifyEvent(-2, 46, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号46
ModifyEvent(-2, 47, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号47
ModifyEvent(-2, 48, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号48
ModifyEvent(-2, 49, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号49
ModifyEvent(-2, 50, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号50
ModifyEvent(-2, 51, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号51
ModifyEvent(-2, 52, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号52
ModifyEvent(-2, 53, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号53
ModifyEvent(-2, 54, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号54
Talk(0, "你就是東方不敗？＜怎麼看起來像個娘們？＞", "talkname0", 1);
Talk(33, "小子，梅莊的帳還沒跟你算，你還敢上黑木崖來．", "talkname33", 0);
Talk(0, "嗨！四位近來過的如何？”麻將”的技術有沒有更精進呢？", "talkname0", 1);
Talk(27, "啊！你便是到梅莊救走任我行的那小子．我早想見你一見，看看是怎樣的一位俊俏　郎君．哼，依我看也是平平無奇，比起我那蓮弟來，可差的遠了．", "talkname27", 0);
Talk(0, "幹嘛？小心得”愛滋”．", "talkname0", 1);
Talk(27, "黃鐘公，我令你們在杭州好好看守著任我行，原來你們都在給我玩什麼”麻將”．", "talkname27", 0);
Talk(34, "小的該死！唉！玩物喪志．都因屬下四人沈溺於琴棋書畫，給人窺到這老大弱點，定下奸計將那人劫了出去．", "talkname34", 0);
Talk(33, "教主文成武德，仁義英明，望教主再給我們四兄弟一個機會，將這小子拿下．", "talkname33", 0);
Talk(26, "什麼文成武德，仁義英明，東方不敗，你肉不肉麻啊！", "talkname26", 0);
DarkScence();
ModifyEvent(-2, 55, 1, 1, -1, -1, -1, 6078, 6078, 6078, -2, -2, -2);--by fanyu 任我行出场 场景26-编号55
jyx2_ReplaceSceneObject("", "NPC/renwoxing", "1");--任我行出场
LightScence();
Talk(0, "老頭子，是你．那天你怎麼不敢跟我比劃，還暗算我．", "talkname0", 1);
Talk(26, "小兄弟，多虧你了．要不是你誤打誤撞，我任我行此刻還在地牢內呢．", "talkname26", 0);
if TeamIsFull() == false then goto label0 end;
    Talk(26, "今天你是來搶”笑傲江湖”一書的吧．我來此本是想幫你一把的，但看你人手似乎已然足夠，我就在一旁看你們表演吧．", "talkname26", 0);
::label0::
    if TeamIsFull() == true then goto label1 end;
        Talk(26, "今天你是來搶”笑傲江湖”一書的吧．我就幫你一把，算是一點謝意．", "talkname26", 0);
::label1::
        Talk(0, "你究竟是誰？", "talkname0", 1);
        Talk(26, "我是誰，你問這個娘娘腔的傢伙好了．東方不敗，恭喜你練成了”葵花寶典”上的武功．", "talkname26", 0);
        Talk(27, "任教主，這部”葵花寶典”是你傳給我的．我一直念著你的好處．", "talkname27", 0);
        Talk(0, "＜原來他是日月神教的前任  教主？＞", "talkname0", 1);
        Talk(26, "是嗎？因此你將我關在西湖湖底，教我不見天日．", "talkname26", 0);
        Talk(27, "我沒殺你，是不是？只須我叫江南四友不送水給你喝，你能捱的了十天半月嗎？", "talkname27", 0);
        Talk(26, "這樣說來，你待我還算不錯了？", "talkname26", 0);
        Talk(27, "正是．我讓你在杭州西湖頤養天年．常言道，上有天堂，下有蘇杭．西湖風景，那是天下有名的了，孤山梅莊，更是西湖景色絕佳之處．", "talkname27", 0);
        Talk(26, "原來你讓我在西湖湖底的黑牢中頤養天年．那可要多謝你了．", "talkname26", 0);
        Talk(27, "任教主，你待我的種種好處我永遠記得．你破格提拔，連年升我職，甚至連本教至寶的”葵花寶典”也傳給了我．此恩此德東方不敗永不敢忘．初時我一心只想做日月神教教主，想什麼千秋萬載，一統江湖，於是處心積慮的謀你的位，翦除你的羽翼．我初當教主，那可意氣風發了，說什麼文成武德，中興聖教，當真是不要臉的胡吹法螺．直到後來修習”葵花寶典”才慢慢悟到了人生妙諦．其後勤修內功，數年之後，終於明白了天人化生，萬物滋長的要道．如今，我最羨慕的就是那些青春年少的嬌媚女子，如果能易地而處，別說日月神教的教主，就算是皇帝老子，我也不做．", "talkname27", 0);
        Talk(0, "你這男扮女裝的老旦，真令人噁心．", "talkname0", 1);
        Talk(27, "大膽！", "talkname27", 0);
        if TeamIsFull() == true then goto label2 end;
            Join(26);
::label2::
            if InTeam(26) == false then goto label3 end;
                if TryBattle(57) == true then goto label4 end;
::label3::
                    if TryBattle(54) == true then goto label5 end;
                        Dead();
                        do return end;
::label4::
::label5::
                        ModifyEvent(-2, 55, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
                        ModifyEvent(-2, 0, 1, 1, 321, -1, -1, 5910, 5910, 5910, -2, -2, -2);--by fanyu 启动脚本321，改变人物贴图 场景26-编号0
                        ModifyEvent(-2, 1, 1, 1, 321, -1, -1, 5908, 5908, 5908, -2, -2, -2);--by fanyu 启动脚本321，改变人物贴图 场景26-编号1
                        ModifyEvent(-2, 86, 1, 1, -1, -1, -1, 7966, 7966, 7966, -2, -2, -2);--by fanyu 启动脚本321，改变人物贴图 场景26-编号86
                        LightScence();
                        if InTeam(26) == false then goto label6 end;
                            Leave(26);
::label6::                  Talk(26, "東方不敗，今日終於．．．終於教你落在我手裡．", "talkname26", 0);
                            Talk(27, "任教主，終究是．．是．．終究是．．是我輸了．", "talkname27", 0);
                            Talk(26, "哈！哈！你這大號，可得改一改罷？", "talkname26", 0);
                            Talk(27, "倘若單打獨鬥，你們是不能打敗我的．", "talkname27", 0);
                            Talk(26, "不錯，你武功比我高，我很是佩服．", "talkname26", 0);
                            Talk(0, "閣下武功極高，不愧稱得”天下第一”四字，在下十分欽佩．", "talkname0", 1);
                            Talk(27, "你二位能這麼說，足見男子漢大丈夫氣概．唉，冤孽，冤孽，我練了那”葵花寶典”，照著寶典上的秘方，自宮練氣，煉丹服藥，漸漸的鬍子沒有了，說話聲音變了，性子也變了．我從此不愛女子，把七個小妾都殺了，卻．．．卻把全副心意放在蓮弟身上．倘若我生為女兒身，那就好了．任教主，你快把我殺了！", "talkname27", 0);
                            Talk(26, "我現在不想殺你了，我也找個地方安養你好了．來人啊，把他帶下去．", "talkname26", 0);
                            Talk(27, "你好狠毒！", "talkname27", 0);
                            DarkScence();
                            jyx2_ReplaceSceneObject("", "NPC/dongfangbubai", "");--东方不败离场
                            ModifyEvent(-2, 86, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 人物离场 场景26-编号86
                            LightScence();
                            jyx2_ReplaceSceneObject("", "NPC/renwoxing", "");--任我行战到教主之位
                            jyx2_ReplaceSceneObject("", "NPC/renjiaozhu", "1");--任教主登场
                            Talk(33, "恭喜教主，今日誅卻大逆．從此我教在教主庇蔭之下，揚威四海．教主千秋萬載，一統江湖．", "talkname33", 0);
                            Talk(26, "胡說八道！什麼千秋萬載？哈！哈！哈！小兄弟，這一役誅奸復位，你實佔首功．這本”笑傲江湖”你就拿去吧．江湖上的人以為它是個高深的武功秘笈，其實只不過是本故事書罷了．", "talkname26", 0);
                            Talk(26, "要說到真正的武功秘笈，有什麼能比的上這本”葵花寶典”呢？可惜，這並不是常人可以練的．", "talkname26", 0);
                            Talk(0, "這話怎講？", "talkname0", 1);
                            Talk(26, "這寶典的第一頁就註明著，”欲練神功，引刀自宮”，老夫可不會沒了腦子，去幹這等傻事．哈哈，哈哈．．．．可是寶典上所載的武功實在厲害，任何學武之人，一見之後卻不能不動心．東方不敗，饒你奸詐似鬼，也猜不透老夫傳你”葵花寶典”的用意．你野心勃勃，意存拔扈，難道老夫瞧不出來嗎？哈哈，哈哈！", "talkname26", 0);
                            Talk(0, "＜原來當初任教主以”葵花  寶典”傳他，當初便沒懷  善意．＞＜兩人爾虞我詐各懷心機＞”葵花寶典”一書，不知任教主能否借在下一看．", "talkname0", 1);
                            Talk(26, "不行，此書乃是本教鎮教之寶，不得借於外人．小兄弟，這太監練的武功，我看你就別想學了，別太貪心，走上”邪路”了．", "talkname26", 0);
                            GetItem(151, 1);
                            ModifyEvent(-2, 83, 0, 0, -1, -1, 327, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本327， 场景26-编号83
                            ModifyEvent(-2, 84, 0, 0, -1, -1, 327, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本327， 场景26-编号84
                            ModifyEvent(-2, 85, 0, 0, -1, -1, 327, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本327， 场景26-编号85
                            ModifyEvent(-2, 2, -2, -2, 323, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本323， 场景26-编号2
                            ModifyEvent(-2, 3, -2, -2, 325, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本325， 场景26-编号3
                            ModifyEvent(-2, 4, -2, -2, 324, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本324， 场景26-编号4
                            ModifyEvent(-2, 5, -2, -2, 326, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本326， 场景26-编号5
                            ModifyEvent(-2, 6, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号6
                            ModifyEvent(-2, 7, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号7
                            ModifyEvent(-2, 8, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号8
                            ModifyEvent(-2, 9, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号9
                            ModifyEvent(-2, 10, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号10
                            ModifyEvent(-2, 11, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号11
                            ModifyEvent(-2, 12, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号12
                            ModifyEvent(-2, 13, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号13
                            ModifyEvent(-2, 14, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号14
                            ModifyEvent(-2, 15, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号15
                            ModifyEvent(-2, 16, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号16
                            ModifyEvent(-2, 17, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号17
                            ModifyEvent(-2, 18, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号18
                            ModifyEvent(-2, 19, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号19
                            ModifyEvent(-2, 20, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号20
                            ModifyEvent(-2, 21, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号21
                            ModifyEvent(-2, 22, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号22
                            ModifyEvent(-2, 23, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号23
                            ModifyEvent(-2, 24, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号24
                            ModifyEvent(-2, 25, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号25
                            ModifyEvent(-2, 26, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号26
                            ModifyEvent(-2, 27, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号27
                            ModifyEvent(-2, 28, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号28
                            ModifyEvent(-2, 29, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号29
                            ModifyEvent(-2, 30, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号30
                            ModifyEvent(-2, 31, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号31
                            ModifyEvent(-2, 32, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号32
                            ModifyEvent(-2, 33, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号33
                            ModifyEvent(-2, 34, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号34
                            ModifyEvent(-2, 35, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号35
                            AddEthics(4);
                            AddRepute(21);
do return end;
