Talk(39, "在下和木兄弟僻處荒島，今日得見高賢，大感榮寵．只是荒島之上，諸物簡陋，款待未周，還請見諒．", "talkname39", 0);
Talk(40, "公子遠到光臨，敝島無以為敬．這碗臘八粥外邊倒還不易喝到，其中最主要的一味”斷腸蝕骨腐心草”，要開花之後效力方著．但這草隔十年才開一次花．我們總要等其開花之後，這才邀請江湖同道來此同享，屈指算來這是第三回邀請．請，請，不用客氣．", "talkname40", 0);
Talk(0, "在下心中有個疑問，想請教前輩？", "talkname0", 1);
Talk(39, "但說無妨．", "talkname39", 0);
Talk(0, "不知兩位島主為何花下偌大心機，將各大掌門召來，並將之殺害．", "talkname0", 1);
Talk(39, "公子此言差矣！道路傳言，焉能盡信．", "talkname39", 0);
Talk(0, "依島主之言，這些武林高手，一個都沒有死？", "talkname0", 1);
Talk(40, "凡人皆有壽數天年，大限既屆，若非大羅金仙，焉得不死？俠客島並無殺害任何一人．", "talkname40", 0);
Talk(0, "那這些人為何都消失了？", "talkname0", 1);
Talk(39, "此事且聽我們慢慢道來．大約三十年前，我和木兄弟訂交，意氣相投，本想聯手江湖，在武林中賞善罰惡，好好做一番事業．不意甫出江湖，便發現了一張地圖．從那圖旁所注的小字中細加參詳，得悉圖中所繪的無名荒島之上，藏有一份驚天動地的武功秘訣．", "talkname39", 0);
Talk(0, "那座無名荒島就是這俠客島吧．", "talkname0", 1);
Talk(39, "公子說的不錯．地圖上這座無名荒島，便是眼前所在之俠客島了．我們依著圖中所示，在島上尋找了十八天，終於找到了武功秘訣的所在．原來那是一首古詩的圖解，含義極是深奧繁複．我二人大喜之下，即按圖解修習．但我倆修習數月後，忽然對這圖解中所示武功產生了歧見．我說該當如此練，木兄卻說我想法錯了，須得那樣練．也許我二人資質太差，而圖解中所示的功夫又太深奧，以至專研了幾個月，仍是疑難不解．後來我和木兄弟詳行計議，看來若要通解全圖，非集思廣義不可．常言道的好：三個臭皮匠，抵個諸葛亮．咱們何不廣邀天下奇材異能之士同來島上各竭心思，一齊參研．恰好其時島上的”斷腸蝕骨腐心草”開花，此草若再配以其他佐使之藥熬成熱粥，服後於我輩練武之士大有裨益，於是我二人派出使者，邀請當世名門大派掌門人，各教教主，各幫幫主，來到敝島喝碗臘八粥．喝過粥後再請他們去參研圖解．", "talkname39", 0);
Talk(0, "如此說來，你們邀人來喝臘八粥，純是一番好意了．", "talkname0", 1);
Talk(39, "是的．而且我們並無禁止任何人離去，而是每位武林之士皆沉迷於此圖解的專研．但可惜的是，到如今大家還是沒有完全領悟出此古詩圖解．唉！我們雖找了許多飽讀詩書的賢士來此，但也無法解開這古詩之謎．現在就請少俠入洞內參研，或許天從因緣，破解此詩的福份就落在少俠身上．若少俠想離去，也可自行離去．", "talkname39", 0);
GetItem(32, 1);
ModifyEvent(-2, 2, -2, -2, 381, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, 382, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 0, -2, -2, 368, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 1, -2, -2, 369, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 16, 0, 0, -1, -1, 371, -2, -2, -2, -2, -2, -2);
--Add3EventNum(-2, 4, 0, 0, 26)
--Add3EventNum(-2, 5, 0, 0, 26)
--Add3EventNum(-2, 6, 0, 0, -1)
do return end;
