Talk(23, "銀光燦爛，鞍自平穩．天馬行空，瞬息萬里．．．原來天馬是手．並非真的是馬．", "talkname23", 0);
if InTeam(38) == true then goto label0 end;
    Talk(23, "這壁上的注解說道：白居易詩云”勿輕直折劍，猶勝曲全勾”．可見我這直折之劍，方合石壁注文原意．", "talkname23", 0);
    Talk(20, "不對，”吳鉤霜雪明”是主，”猶勝曲全鉤”是賓．喧賓奪主，必非正道．", "talkname20", 1);
    do return end;
::label0::
    jyx2_ReplaceSceneObject("", "NPC/shipotian2", "1");--石破天出现
    Talk(38, "＜這些口訣甚是深奧，我是弄不明白的．唉！沒讀過書就是不行．＞", "talkname38", 1);
    Talk(23, "這壁上的注解說道：白居易詩云”勿輕直折劍，猶勝曲全勾”．可見我這直折之劍，方合石壁注文原意．", "talkname23", 0);
    Talk(20, "不對，”吳鉤霜雪明”是主，”猶勝曲全鉤”是賓．喧賓奪主，必非正道．", "talkname20", 1);
    Talk(38, "＜咦！這些字的筆劃看起來好像是一把把的長劍，有的劍尖朝上，有的向下，有的斜起欲飛，有的橫掠欲墮．”五里穴”好熱．．．現在跑到”曲池穴”了．．自從練了木偶身上的經脈圖之後，內力大盛，但從沒像今日這般勁急．．．＞", "talkname38", 1);
    --Add3EventNum(-2, 4, 0, 0, 26)
    --Add3EventNum(-2, 5, 0, 0, 26)
    --Add3EventNum(-2, 6, 0, 0, 3)
    ModifyEvent(-2, 10, -2, -2, 387, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 11, -2, -2, 387, -1, -1, -2, -2, -2, -2, -2, -2);
    jyx2_ReplaceSceneObject("", "NPC/shipotian2", "");--石破天出现
do return end;
