if InTeam(38) == true then goto label0 end;
    do return end;
::label0::
jyx2_ReplaceSceneObject("", "NPC/shipotian4", "1");--石破天出现
    Talk(38, "大哥，這沒有什麼好看的，我們走了好不好．．．", "talkname38", 1);
    Talk(0, "賢弟，小聲一點，別吵到兩位島主練功．．", "talkname0", 1);
    Talk(38, "＜這些字怎麼如此古怪，看上一眼，便會頭暈？＞＜至陽穴好熱，原來這些蝌蚪看似亂鑽亂遊，其實還是和內息有關＞", "talkname38", 1);
    Talk(39, "這位石兄弟雙眼注目這”太玄經”，原來是位精通蝌蚪文的大方家．", "talkname39", 0);
    Talk(38, "小人一個字也不識，只是瞧這些小蝌蚪十分好玩，便多看了一會．", "talkname38", 1);
    Talk(39, "這就是了，這部”太玄經”以古蝌蚪文寫成，我本來正自奇怪，石兄弟年紀輕輕，居然有此奇才，識得這種古奧文字．", "talkname39", 0);
    Talk(38, "＜我還是別打擾二位島主好了．．．可是這蝌蚪還真好玩．．．＞＜咦！這些蝌蚪怎麼在我身體各處跑了起來．．．．．怎麼這樣地舒暢．．．．＞", "talkname38", 1);
    Talk(0, "賢弟，你幹什麼？", "talkname0", 1);
    DarkScence();
    LightScence();
    Talk(38, "啊！好累．我怎麼覺得好累．", "talkname38", 1);
    Talk(0, "賢弟，你總算清醒過來了．", "talkname0", 1);
    Talk(38, "怎麼，難道我昏迷過去了嗎？", "talkname38", 1);
    Talk(0, "是啊！原先我以為你又著魔了，後來龍島主說你正悟出神功，我才沒有去吵你，前後算起來已有三天了．", "talkname0", 1);
    Talk(38, "是嗎？已經三天了，難怪我覺得好餓．", "talkname38", 1);
    Talk(0, "賢弟，你總算清醒過來了．", "talkname0", 1);
    Talk(39, "石兄弟，我兄弟倆悶在心中數十年的大疑團，終於得以解開，真是太感激你了．　　　　　　　　", "talkname39", 0);
    Talk(38, "我怎麼．．怎麼解破的?", "talkname38", 1);
    Talk(39, "石兄弟何必如此謙虛？你參透了這首”俠客行”的石壁圖譜，不但是現今武林中的第一人，除了當年在石壁上雕寫圖譜的那位前輩之外，只怕古往今來，也極少有人及得上你．", "talkname39", 0);
    Talk(38, "小人不敢，小人不敢．", "talkname38", 1);
    Talk(39, "這石壁上的蝌蚪古文，在下與木兄弟所識還不到一成，不知石兄弟肯賜予指教麼？", "talkname39", 0);
    Talk(38, "我跟兩位說了便是，我看這條蝌蚪，”中注穴”中便有跳動;再看這條蝌蚪，”太赫穴”便大跳一下．．．．", "talkname38", 1);
    Talk(39, "原來．．原來．．石幫主看的是一條條．．那個蝌蚪，不是看一個個字．．．那麼石幫主如何能通解全篇”太玄經”？", "talkname39", 0);
    Talk(38, "小人自幼沒讀過書，當真一字不識，慚愧的緊．", "talkname38", 1);
    Talk(40, "你不識字？", "talkname40", 0);
    Talk(38, "不識字．我．．回去之後，定要去學識字，否則人人都識字，我卻不識得，給人笑話，多不好意思．", "talkname38", 1);
    Talk(39, "你既不識字，那麼這些壁上許許多多的注釋，卻是誰解給你聽的？", "talkname39", 0);
    Talk(38, "沒人解給我聽．我．．．只是瞧著圖形，胡思亂想，忽然之間，圖上的雲頭或小劍什麼的，就和身體內的熱氣連在一起了．", "talkname38", 1);
    Talk(40, "你不識字，卻能解通圖譜，這．．．如何能夠？", "talkname40", 0);
    Talk(39, "難道冥冥之中真有天意？還是這位石兄弟真有天縱英才．", "talkname39", 0);
    Talk(40, "．．．．．我懂了，我懂了．大哥，原來如此．", "talkname40", 0);
    Talk(40, "啊！是了．是了．石兄弟，幸虧你不識字，才得解破這個大疑團．唉！原來這許許多多注釋文字，每一句都在導人誤入歧途．可是參研圖譜之人，又有那個肯不去鑽研注解．", "talkname40", 0);
    Talk(39, "原來這篇”太玄經”也不是真的蝌蚪文，只不過．．．只不過是一些經脈穴道的線路方位而已．唉，三十年的光陰，三十年的光陰！", "talkname39", 0);
    Talk(40, "白首太玄經！兄弟，你的頭髮也真是雪白了．", "talkname40", 0);
    Talk(39, "當年金先生也曾勸我們別太鑽研此圖譜，只須以平常心來看待，我倆當時又何嘗聽得下去呢？", "talkname39", 0);
    Talk(0, "你們見過金前輩？", "talkname0", 1);
    Talk(39, "是啊！年輕時，我們初得此圖譜時有過一面之緣．", "talkname39", 0);
    Talk(0, "那你們可知那十四部書的下落？", "talkname0", 1);
    Talk(39, "別的我不知道，但和本島同名的”俠客行”一書，此刻是在我身上．因當時認為是否與此圖譜有關，於是將它取來．不過後來一看，竟看不懂，不知寫些什麼．", "talkname39", 0);
    Talk(0, "那這本書．．", "talkname0", 1);
    Talk(39, "如今，圖譜之迷已解，太玄神功已被石兄弟練成，這本書對我們也沒什麼意義了．你要就拿去吧．", "talkname39", 0);
    Talk(0, "謝謝龍島主，這東西對我可關係重大了．賢弟，你這回可立了一件大功．", "talkname0", 1);
    Talk(38, "不識字難道也有好處？", "talkname38", 1);
    Talk(39, "兄弟，你我心願已了，我們也該歇息了．這臘八粥之約以後也不必了．我們這就去告訴各位掌門不用再鑽研此圖解了．公子，你們也可趕緊離去，但千萬別對人說石兄弟已練成此神功，否則後患無窮．", "talkname39", 0);
    Talk(0, "前輩，告辭了．", "talkname0", 1);
    jyx2_ReplaceSceneObject("", "NPC/shipotian4", "");--石破天出现
    jyx2_ReplaceSceneObject("", "NPC/daozhu2", "1");-- 
    jyx2_ReplaceSceneObject("", "NPC/daozhu1", "1");-- 
    jyx2_ReplaceSceneObject("", "NPC/daozhu21", "");-- 
    jyx2_ReplaceSceneObject("", "NPC/daozhu11", "");-- 
    GetItem(154, 1);
    GetItem(60, 1);
    DarkScence();
    ModifyEvent(-2, 0, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 1, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 7, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 8, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 9, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 11, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 12, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 13, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 16, 0, 0, -1, -1, 388, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 17, 0, 0, -1, -1, 388, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 18, 0, 0, -1, -1, 388, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 2, 1, 1, 364, -1, -1, 5132, 5132, 5132, -2, -2, -2);
    ModifyEvent(-2, 3, 1, 1, 365, -1, -1, 5136, 5136, 5136, -2, -2, -2);
    ModifyEvent(-2, 14, 1, 1, 366, -1, -1, 5148, 5148, 5148, -2, -2, -2);
    ModifyEvent(-2, 15, 1, 1, 367, -1, -1, 5142, 5142, 5142, -2, -2, -2);
    jyx2_ReplaceSceneObject("", "NPC/NPC 7", "");--侠客岛众人离去
    jyx2_ReplaceSceneObject("", "NPC/NPC 8", "");-- 
    jyx2_ReplaceSceneObject("", "NPC/NPC 9", "");-- 
    jyx2_ReplaceSceneObject("", "NPC/NPC10", "");-- 
    jyx2_ReplaceSceneObject("", "NPC/NPC11", "");-- 
    LightScence();
    LearnMagic2(38, 23, 0);
    AddAttack(38, 10);
do return end;
