Talk(23, "銀光燦爛，鞍自平穩．天馬行空，瞬息萬里．．．原來天馬是手．並非真的是馬．", "talkname23", 0);
Talk(38, "＜這些口訣甚是深奧，我是弄不明白的．唉！沒讀過書就是不行．＞", "talkname38", 1);
Talk(23, "這壁上的注解說道：白居易詩云”勿輕直折劍，猶勝曲全勾”．可見我這直折之劍，方合石壁注文原意．", "talkname23", 0);
Talk(20, "不對，”吳鉤霜雪明”是主，”猶勝曲全鉤”是賓．喧賓奪主，必非正道．", "talkname20", 1);
Talk(38, "＜咦！這些字的筆劃看起來好像是一把把的長劍，有的劍尖朝上，有的向下，有的斜起欲飛，有的橫掠欲墮．”五里穴”好熱．．．現在跑到”曲池穴”了．．自從練了木偶身上的經脈圖之後，內力大盛，但從沒像今日這般勁急．．．＞", "talkname38", 1);
jyx2_ReplaceSceneObject("", "NPC/daozhu2", "");-- 
jyx2_ReplaceSceneObject("", "NPC/daozhu1", "");-- 
jyx2_ReplaceSceneObject("", "NPC/daozhu21", "1");-- 
jyx2_ReplaceSceneObject("", "NPC/daozhu11", "1");-- 
ModifyEvent(-2, 12, 1, 1, 363, -1, -1, 5134, 5134, 5134, -2, -2, -2);
ModifyEvent(-2, 13, 1, 1, 363, -1, -1, 5138, 5138, 5138, -2, -2, -2);
ModifyEvent(-2, 4, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 5, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 6, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
do return end;

