Talk(0, "前輩，我送你的玉蜂漿很有用吧．", "talkname0", 1);
Talk(64, "你的玉蜂漿固然有用，但我養蜂的本事更是高強．", "talkname64", 0);
Talk(0, "哦？", "talkname0", 1);
Talk(64, "你沒看，我培養出一批天下無雙，人間罕見的異種來，當真是巧奪天工，造化之奇也無如此奇法．", "talkname64", 0);
Talk(0, "不知是怎樣的奇法？", "talkname0", 1);
Talk(64, "小兄弟，我且問你．人是萬物之靈，身上有刺花刺字，或刺盤龍虎豹，或書天下太平．但除了人之外，禽獸蟲蟻身上，可有刺字的？", "talkname64", 0);
Talk(0, "虎有黃斑，豹有金錢，至於蝴蝶毒蛇，身上花紋更奇於刺花百倍．", "talkname0", 1);
Talk(64, "但你見過蟲蟻身上有字的沒有？", "talkname64", 0);
Talk(0, "你說是天生的麼？那倒沒見過．", "talkname0", 1);
Talk(64, "好，今天給你開一開眼界．仔細看看那些蜜蜂的翅膀．", "talkname64", 0);
Talk(0, "咦！真的有字．好像是”情谷底”三個字．", "talkname0", 1);
Talk(64, "看到沒有．", "talkname64", 0);
Talk(0, "＜這字決非天生，分明是有  人故意刺成的．＞這那是什麼天下無雙，人間罕見了，八成是你用繡花針刺上去的，對不對．", "talkname0", 1);
Talk(64, "你說什麼？你再看看其他的蜜蜂．", "talkname64", 0);
Talk(0, "這．．這．怎麼每隻都有．而且寫的字都不太一樣．這隻寫的是”我在絕”．", "talkname0", 1);
Talk(64, "我還看過別隻上面寫的是”二午寺”，還有”一山惡”的．你說，這全都是我寫的嗎？", "talkname64", 0);
Talk(0, "”情谷底”，”我在絕”，”二午寺”，”一山惡”．．．．這到底是什麼意思？前輩，這蜜蜂不是你自己養的吧！", "talkname0", 1);
Talk(64, "咦，你怎麼知道？", "talkname64", 0);
Talk(0, "我胡亂猜的．", "talkname0", 1);
Talk(64, "這些蜜蜂是從北邊山脈飛來的，起先我也嚇了一大跳．", "talkname64", 0);
Talk(0, "我看這事有點怪異．", "talkname0", 1);
Talk(64, "看來你還是不服氣的樣子，你等著好了，我會養出更奇怪的蜜蜂來．", "talkname64", 0);
ModifyEvent(-2, 4, -2, -2, 406, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动406脚本。场景20-编号4
ModifyEvent(-2, 5, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号5
ModifyEvent(-2, 6, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号6
ModifyEvent(-2, 7, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号7
ModifyEvent(-2, 8, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号8
ModifyEvent(-2, 9, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号9
ModifyEvent(-2, 10, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号10
ModifyEvent(-2, 11, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号11
ModifyEvent(-2, 12, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号12
ModifyEvent(21, 1, 1, 1, 417, -1, -1, 6158, 6158, 6158, -2, -2, -2);--by fanyu|启动417脚本，改变贴图。场景21-编号01
ModifyEvent(21, 4, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(40, 9, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景40-编号09
ModifyEvent(40, 10, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景40-编号10
ModifyEvent(40, 11, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景21-编号11
ModifyEvent(40, 12, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景21-编号12
OpenScence(80);
do return end;
