Talk(66, "小子，事情辦好了嗎？", "talkname66", 0);
Talk(0, "晚輩已見過了段皇爺．", "talkname0", 1);
Talk(66, "你殺了他了？", "talkname66", 0);
Talk(0, "沒有．", "talkname0", 1);
Talk(66, "哼！連這事都辦不好，我原本還指望你上桃花島幫我救周伯通呢．", "talkname66", 0);
Talk(0, "救周伯通？他早己不在桃花島了，聽說他逃了出來．", "talkname0", 1);
Talk(66, "真的？", "talkname66", 0);
Talk(0, "晚輩覺得前輩還是不要報這個仇，何況你兒子也不是段皇爺所殺的．", "talkname0", 1);
Talk(66, "雖非他所殺，但也是被他害死的．", "talkname66", 0);
Talk(0, "段皇爺不肯救你兒子，也是因為愛你啊．", "talkname0", 1);
Talk(66, "哼，愛我？", "talkname66", 0);
Talk(0, "他是喝周前輩的醋．若是不愛你，他為什麼要喝醋？他見到你那塊”四張機”的鴛鴦錦帕，實是傷心至極．依我看這件事還是算了吧．", "talkname0", 1);
Talk(66, "．．．．．那好，只要你把周伯通找來見我，我就告訴你”射鵰英雄傳”一書的下落．", "talkname66", 0);
Talk(0, "這個簡單，只要不叫我去殺好人都可以．", "talkname0", 1);
ModifyEvent(-2, -2, -2, -2, 421, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动421脚本。场景21-编号01
ModifyEvent(20, 4, -2, -2, 411, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动411脚本。场景20-编号04
ModifyEvent(47, 0, -2, -2, 428, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动428脚本。场景47-编号00
ChangeMMapMusic(3);
do return end;
