Talk(64, "來來來，小兄弟，我教你一個好玩的遊戲．", "talkname64", 0);
Talk(0, "什麼遊戲？", "talkname0", 1);
Talk(64, "我老頑童獨創的”左右互搏之術”．這是當年我被黃老邪關在桃花島十五年間，無聊時所創出的武功．要知在這十五年中，我苦無對手拆招，只好左手和右手打架．", "talkname64", 0);
Talk(0, "左手怎能和右手打架？", "talkname0", 1);
Talk(64, "我假裝右手是黃老邪，左手是老頑童．右手一掌打去，左手拆開之後還了一拳，就這樣打了起來．", "talkname64", 0);
Talk(0, "這功夫很難學吧？", "talkname0", 1);
Talk(64, "說難是難到極處，說容易也容易之至．有的人一輩子都學不會，有的人只需幾天便會了．好像越是聰明，越是不成，看看你是否有這機緣看著了．．．第一課”左手畫方，右手畫圓”．．．．", "talkname64", 0);
DarkScence();
LightScence();
Talk(64, "功夫是教你了，接下來就看看你有沒有這造化了．", "talkname64", 0);
GetItem(91, 1);
ModifyEvent(-2, -2, -2, -2, 413, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本413。场景20-编号04
do return end;
