Talk(0, "老前輩，你在吃什麼？這麼香啊．", "talkname0", 1);
Talk(69, "”香肉”當然香了．喂，我可不會分你，老叫化我一個人都吃不夠了．", "talkname69", 0);
Talk(0, "是不是黑狗肉啊，聽說黑狗肉最香了．", "talkname0", 1);
Talk(69, "你還蠻懂的吃的嘛．沒錯，”一黑二黃三花四白”說的就是吃狗肉的秘訣．不過呢這肉雖好吃，還是比不上黃蓉那女娃兒的手藝．那道菜叫什麼來著，對了，是”玉笛誰家聽落梅”．想起來我就流口水．", "talkname69", 0);
ModifyEvent(-2, -2, -2, -2, 461, 462, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本461,462 场景23-编号0
ModifyEvent(32, 0, -2, -2, 675, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本675 场景32-编号0
 jyx2_ReplaceSceneObject("32", "NPC/linchuzi", "1"); 
do return end;
