Talk(0, "晚輩參見郭大俠，黃女俠．", "talkname0", 1);
Talk(56, "你是來找”射鵰英雄傳”的吧．", "talkname56", 0);
Talk(0, "江湖中人傳言果然不假，黃女俠的聰明機智真是令人敬佩．沒錯，此次上桃花島拜見二位，主要目的就是為了”射鵰英雄傳”一書．", "talkname0", 1);
Talk(56, "來到這裡，費了番功夫吧．", "talkname56", 0);
Talk(0, "是費了番功夫，不過若是能拿到”射鵰英雄傳”，再苦也是值得的．", "talkname0", 1);
Talk(55, "沒錯，”射鵰英雄傳”一書是在我夫婦手裡，給你也是可以．", "talkname55", 0);
Talk(0, "多謝郭大俠及黃女俠．", "talkname0", 1);
Talk(55, "小兄弟，你叫我一聲大俠．我問你，為什麼江湖上人會尊稱我一聲郭大俠．", "talkname55", 0);
Talk(0, "那是因為郭大俠武功高強，降龍十八掌威震八方．", "talkname0", 1);
Talk(55, "我再問你，為什麼我們要練武功．", "talkname55", 0);
Talk(0, "因為武功若練的比別人強，則可以壓制對方，做到你想要做的事．當然啦，我不是說要去欺壓別人，而是你若武功比不上對方，拿什麼去行俠仗義？", "talkname0", 1);
Talk(55, "我輩練功學武，所為何事？行俠仗義，濟人困厄固然是本份，但那只是俠之小者．江湖上所以尊稱我一聲郭大俠，實乃敬我早年為國為民，奮不顧身地戍守襄陽．然我能力有限，不能為民解困，有愧這”大俠”二字．我想你聰明智慧過我十倍，　　　將來的成就定然遠勝於我．　　　　只盼你心頭牢牢記著：”為國為民，俠之大者”這八個字，日後名揚天下，成為萬民敬仰的真正大俠．", "talkname55", 0);
Talk(0, "．．．．", "talkname0", 1);
Talk(55, "所以說，只要你能發揮一個俠者的風範，這本書我就直接送給你．不然，你就得勝過我才能拿走這本書．為了讓你好好的修練，我就送你一些東西，以免你去偷別人的東西，誤入歧途．在廚房角落的櫃子裡，放有一些我桃花島的獨特藥丸，你就拿去吧．", "talkname55", 0);
if JudgeEventNum(3, -1) == true then goto label0 end;
    ModifyEvent(-2, 3, -2, -2, 924, -1, -1, -2, -2, -2, -2, -2, -2);
::label0::
    if JudgeEventNum(4, -1) == true then goto label1 end;
        ModifyEvent(-2, 4, -2, -2, 925, -1, -1, -2, -2, -2, -2, -2, -2);
::label1::
        Talk(0, "．．．．", "talkname0", 1);
        if JudgeEthics(0, 90, 100) == false then goto label2 end;
            Talk(55, "你在江湖上的作為，我夫婦倆已有所聞，這書你就拿去吧．", "talkname55", 0);
            GetItem(148, 1);
            ModifyEvent(-2, 1, -2, -2, 467, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 2, -2, -2, 468, -1, -1, -2, -2, -2, -2, -2, -2);
            do return end;
::label2::
            ModifyEvent(-2, 1, -2, -2, 469, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 2, -2, -2, 475, -1, -1, -2, -2, -2, -2, -2, -2);
            Talk(55, "要成為一個真正的俠客，或是只想擁有高強的武功，就看你自己了．", "talkname55", 0);
do return end;
