if UseItem(130) == true then goto label0 end;
    do return end;
::label0::
    AddEthics(2);
    AddItem(130, -1);
    Talk(0, "慕容公子，你要找的大燕國傳國玉璽在這裡．", "talkname0", 1);
    Talk(51, "真的找到了！有了它，我大燕復國有望．", "talkname51", 0);
    Talk(0, "那慕容公子可否履行諾言，告知在下”天龍八部”一書的下落．", "talkname0", 1);
    Talk(51, "等會，有了傳國玉璽並不能證明我慕容復的身份，那麼別人就不會聽我號召．．．大燕皇帝世系譜表呢？大燕皇帝世系譜表呢？", "talkname51", 0);
    Talk(0, "慕容公子並未叫我找那什麼大燕皇帝世系譜表啊！", "talkname0", 1);
    Talk(51, "沒有大燕皇帝世系譜表，別人怎會相信我慕容復是王孫的後代．你快去找大燕皇帝世系譜表，找到了我才跟你說”天龍八部”的下落．", "talkname51", 0);
    Talk(109, "表哥，做人怎可言而無信，你說好要告訴這位公子的，怎可反悔．你不說，我可要告訴他了．", "talkname109", 0);
    Talk(51, "妳敢！", "talkname51", 0);
    Talk(109, "．．．．．", "talkname109", 0);
    Talk(0, "好，我就再信你一次，去幫你找那什麼世系譜表．希望到時慕容公子別再失信．", "talkname0", 1);
    Talk(51, "好了，看你這麼辛苦，我就先送你一本曠世棋譜，就在我房間箱子裡，這是鑰匙．", "talkname51", 0);
    ModifyEvent(-2, -2, -2, -2, 572, 573, -1, -2, -2, -2, -2, -2, -2);
    GetItem(166, 1);
do return end;
