Talk(0, "請問這位師父，這裡就是少林寺嗎？", "talkname0", 1);
Talk(96, "正是．", "talkname96", 0);
Talk(0, "少林寺耶！武學的殿堂，武俠小說中絕對少不了的場景，趕緊進去看一看．", "talkname0", 1);
Talk(96, "方丈率寺中弟子，與其餘五大派共同圍攻光明頂去了，至今未回．請施主下山．", "talkname96", 0);
ModifyEvent(-2, 3, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-3
ModifyEvent(-2, 4, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-4
ModifyEvent(-2, 5, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-5
ModifyEvent(-2, 6, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-6
do return end;
