Talk(70, "少俠就請自己四處看看．", "talkname70", 0);
if InTeam(51) == true then goto label0 end;
    Talk(70, "希望少俠多做善事才是．", "talkname70", 0);
    do return end;
::label0::
    Talk(51, "大師，我們是來向你借一樣東西的．", "talkname51", 1);
    jyx2_ReplaceSceneObject("", "NPC/murongfu", "1");--慕容复
    Talk(70, "不知施主要跟老衲借什麼？", "talkname70", 0);
    Talk(51, "一份信件．", "talkname51", 1);
    Talk(70, "一份信件？", "talkname70", 0);
    Talk(51, "沒錯，一份信件．一份當年武林夙宿們共同草擬的信件．．．一份證明現在丐幫幫主喬峰並不是漢人，而是契丹人的信件．", "talkname51", 1);
    Talk(70, "你是誰！", "talkname70", 0);
    Talk(51, "在下姑蘇慕容復．", "talkname51", 1);
    Talk(70, "你是慕容復，你如何知道此事？", "talkname70", 0);
    Talk(51, "我自然知道．", "talkname51", 1);
    Talk(70, "是了，一定是那個人告訴你的．", "talkname70", 0);
    Talk(0, "慕容公子，這是怎麼回事？什麼漢人，契丹人的？   　　　　　　　　　　", "talkname0", 1);
    Talk(51, "你不知道吧，我看恐怕江湖上也沒幾個人會知道，原來我們丐幫現任的幫主喬峰喬大俠，並不是漢人，而是血腥屠殺漢人的契丹狗．當年這位玄慈方丈率領中原群俠，誤殺了一名契丹人．而那名契丹人留有一子，中原群俠因為愧疚想好好照顧他，就決定由少林寺私下扶養他長大，．．．後來那個孩子當上了丐幫幫主，他就是喬峰．可是呢，當年那些中原群俠又怕喬峰體內所流露的契丹性格，將來會爆發出來，危害到中原武林，於是就寫了一份信件，說明了喬峰的身份，一旦他野性暴露，就將他的身份揭發出來，讓中原群俠一起對付他，就像對付他爹一樣．所以呢，今天我們只要弄到這信件，就可讓喬峰羞愧的無地自容，兄弟你自然也能輕易地得到”天龍八部”了．", "talkname51", 1);
    Talk(70, "阿彌陀佛，阿彌陀佛！當年我們的確誤殺了喬峰他父親．如今他的兒子有這番成就，大仁大義，就是連漢人也比不上的，老衲是不會將那封信件交給你們的．", "talkname70", 0);
    Talk(51, "方丈話別說的這麼快．兄弟，接下來我會讓你知道帶我來的好處．方丈，你還記得”葉二娘”吧？還記得”紫雲洞相會”之事還記得”喬婆婆接生”之事嗎？", "talkname51", 1);
    Talk(70, "你．．你．．你怎麼知．．知道的．．．", "talkname70", 0);
    Talk(51, "我知道的還很多，要不要我再講下去．", "talkname51", 1);
    Talk(70, "不要再講了．．．", "talkname70", 0);
    Talk(51, "那信件呢？", "talkname51", 1);
    Talk(70, "這．．．．．．唉！．．．你們拿去吧．", "talkname70", 0);
    Talk(51, "兄弟，得手了，我們去丐幫揭發喬峰吧．", "talkname51", 1);
    Talk(70, "阿彌陀佛，阿彌陀佛！施主得饒人處且饒人．", "talkname70", 0);
    jyx2_ReplaceSceneObject("", "NPC/murongfu", "");--慕容复
    ModifyEvent(-2, -2, -2, -2, 512, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本512 场景28
    GetItem(183, 1);
    ModifyEvent(-2, 0, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-0
    ModifyEvent(-2, 1, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-1
    ModifyEvent(-2, 2, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-2
do return end;
