Talk(0, "晚輩參見方丈．", "talkname0", 1);
if InTeam(51) == true then goto label0 end;
    Talk(70, "阿彌陀佛．近來江湖上已甚少聽到明教為非作歹之事，這真多虧了少俠．光明頂之役，少俠能在不殺一人下化解了武林的這場大浩劫，減少了生靈的塗炭，功勞不小，真可謂是英雄出少年．", "talkname70", 0);
    Talk(0, "大師過獎了．", "talkname0", 1);
    Talk(70, "不知此次少俠上我少林有何貴事？", "talkname70", 0);
    Talk(0, "大師應該有聽說吧．我正在找一些書籍，線索並　不是很多，心想少林寺乃武　林重地，於是就到這兒來找　找看，就算找不到書，如能　學到一點功夫保身也不錯，　因為少林寺乃正派武學的最　高殿堂，七十二項絕技隨便　精通一樣就不得了了．", "talkname0", 1);
    Talk(70, "關於少俠要找書的事，老衲是略有所聞．不過這十四本書少林寺中並沒有，且少林寺也不會要這些書．因為我少林一派自達摩祖師爺創立以來，對於武學的研究一直不餘遺力，到今日也小有成就．少林寺的七十二項絕技，本寺中人一生能通曉十項以上的已是寥寥無幾，所以更不用說會對本派以外的武功存有什麼興趣．", "talkname70", 0);
    Talk(0, "對於少林寺七十二項絕技，晚輩心儀已久，不知方丈願不願意傳授一些．", "talkname0", 1);
    if JudgeEthics(0, 70, 100) == true then goto label1 end;
        Talk(70, "少俠眼中泛有戾氣，似乎已將武學用於邪道．老衲說什麼也不能讓少林武學用於邪道之上，望少俠早日回頭．", "talkname70", 0);
        ModifyEvent(-2, -2, -2, -2, 513, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本513 场景28-12
        do return end;
::label1::
        Talk(70, "我看你行事正直，老衲頗為欣賞．", "talkname70", 0);
        Talk(0, "謝謝大師抬愛．", "talkname0", 1);
        Talk(70, "但這七十二項絕技是少林寺鎮寺之寶，不能傳給外人．除非少俠願入佛門．．．", "talkname70", 0);
        Talk(0, "是這樣子的啊．．．＜要我剃個大光頭當和尚不知有多少少女會心碎＞", "talkname0", 1);
        Talk(70, "不過除了七十二項絕技外，本寺還有許多功夫是給俗家子弟練的功夫，譬如說．．”達摩劍法”就是其中一項．．．", "talkname70", 0);
        Talk(0, "方丈是說，不用剃光頭也可以學的武功，那我要．", "talkname0", 1);
        Talk(70, "好，我就送你一本達摩劍譜讓你參詳，望你學會這劍法後能多做善事，濟弱扶傾．另外，在本寺中，如果有你需要的東西，儘管拿，別客氣．", "talkname70", 0);
        GetItem(76, 1);
        ModifyEvent(-2, -2, -2, -2, 515, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本515 场景28-12
        if JudgeEventNum(17, -1) == true then goto label2 end;
            ModifyEvent(-2, 17, -2, -2, 874, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本874 场景28-17
::label2::
            if JudgeEventNum(18, -1) == true then goto label3 end;
                ModifyEvent(-2, 18, -2, -2, 875, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本875 场景28-18
::label3::
                if JudgeEventNum(19, -1) == true then goto label4 end;
                    ModifyEvent(-2, 19, -2, -2, 876, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本876 场景28-19
::label4::
                    if JudgeEventNum(20, -1) == true then goto label5 end;
                        ModifyEvent(-2, 20, -2, -2, 877, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本877 场景28-20
::label5::
                        if JudgeEventNum(21, -1) == true then goto label6 end;
                            ModifyEvent(-2, 21, -2, -2, 878, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本878 场景28-21
::label6::
                            do return end;
::label0::
                            Talk(51, "大師，我們是來向你借一樣東西的．", "talkname51", 1);
                            jyx2_ReplaceSceneObject("", "NPC/murongfu", "1");--慕容复
                            Talk(70, "不知施主要跟老衲借什麼？", "talkname70", 0);
                            Talk(51, "一份信件．", "talkname51", 1);
                            Talk(70, "一份信件？", "talkname70", 0);
                            Talk(51, "沒錯，一份信件．一份當年武林夙宿們共同草擬的信件．．．一份證明現在丐幫幫主喬峰並不是漢人，而是契丹人的信件．", "talkname51", 1);
                            Talk(70, "你是誰！", "talkname70", 0);
                            Talk(51, "在下姑蘇慕容復．", "talkname51", 1);
                            Talk(70, "你是慕容復，你如何知道此事？", "talkname70", 0);
                            Talk(51, "我自然知道．", "talkname51", 1);
                            Talk(70, "是了，一定是那個人告訴你的．", "talkname70", 0);
                            Talk(0, "慕容公子，這是怎麼回事？什麼漢人，契丹人的？   　　　　　　　　　　", "talkname0", 1);
                            Talk(51, "你不知道吧，我看恐怕江湖上也沒幾個人會知道，原來我們丐幫現任的幫主喬峰喬大俠，並不是漢人，而是血腥屠殺漢人的契丹狗．當年這位玄慈方丈率領中原群俠，誤殺了一名契丹人．而那名契丹人留有一子，中原群俠因為愧疚想好好照顧他，就決定由少林寺私下扶養他長大，．．．後來那個孩子當上了丐幫幫主，他就是喬峰．可是呢，當年那些中原群俠又怕喬峰體內所流露的契丹性格，將來會爆發出來，危害到中原武林，於是就寫了一份信件，說明了喬峰的身份，一旦他野性暴露，就將他的身份揭發出來，讓中原群俠一起對付他，就像對付他爹一樣．所以呢，今天我們只要弄到這信件，就可讓喬峰羞愧的無地自容，兄弟你自然也能輕易地得到”天龍八部”了．", "talkname51", 1);
                            Talk(70, "阿彌陀佛，阿彌陀佛！當年我們的確誤殺了喬峰他父親．如今他的兒子有這番成就，大仁大義，就是連漢人也比不上的，老衲是不會將那封信件交給你們的．", "talkname70", 0);
                            Talk(51, "方丈話別說的這麼快．兄弟，接下來我會讓你知道帶我來的好處．方丈，你還記得”葉二娘”吧？還記得”紫雲洞相會”之事還記得”喬婆婆接生”之事嗎？", "talkname51", 1);
                            Talk(70, "你．．你．．你怎麼知．．知道的．．．", "talkname70", 0);
                            Talk(51, "我知道的還很多，要不要我再講下去．", "talkname51", 1);
                            Talk(70, "不要再講了．．．", "talkname70", 0);
                            Talk(51, "那信件呢？", "talkname51", 1);
                            Talk(70, "這．．．．．．唉！．．．你們拿去吧．", "talkname70", 0);
                            Talk(51, "兄弟，得手了，我們去丐幫揭發喬峰吧．", "talkname51", 1);
                            Talk(70, "阿彌陀佛，阿彌陀佛！施主得饒人處且饒人．", "talkname70", 0);
                            jyx2_ReplaceSceneObject("", "NPC/murongfu", "");--慕容复
                            ModifyEvent(-2, -2, -2, -2, 512, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本512 场景28
                            GetItem(183, 1);
                            AddEthics(-3);
                            ModifyEvent(-2, 0, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-0
                            ModifyEvent(-2, 1, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-1
                            ModifyEvent(-2, 2, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-2
do return end;
