Talk(0, "喬幫主，我聽別人說，”天龍八部”一書是在丐幫手中，此事當真？", "talkname0", 1);
Talk(50, "沒錯．", "talkname50", 0);
Talk(0, "還請喬幫主能借我此書，因為此書關係到我的未來．", "talkname0", 1);
Talk(50, "少俠可知我丐幫的絕技？", "talkname50", 0);
Talk(0, "素聞丐幫”降龍十八掌”威猛淩厲，是天下掌法第一．", "talkname0", 1);
Talk(50, "是的．因為我丐幫與這”龍”字有點緣份，所以本幫的前輩在當時就取得了十四天書中的”天龍八部”，當做鎮幫之寶留傳至今，並引以為傲．我喬峰身為丐幫幫主，你說，我怎麼將它給你呢．", "talkname50", 0);
Talk(0, "這．．．", "talkname0", 1);
Talk(50, "不過，這事也並不是無解．因為此書原來的主人並不是丐幫，所以我也不會強佔．當初本幫曾定下規矩，若有人能打嬴丐幫的”降龍十八掌”，他就比丐幫更有資格擁有此書．", "talkname50", 0);
Talk(0, "你是說．．．．", "talkname0", 1);
Talk(50, "只要你憑一己之力，能打敗我喬峰，丐幫必當無條件奉上”天龍八部”一書．你準備好時就跟我說一聲．", "talkname50", 0);
ModifyEvent(-2, -2, -2, -2, 528, -2, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本528 场景51-14
do return end;
