Talk(0, "兄弟，你是誰，怎麼會被關在這？", "talkname0", 1);
Talk(37, "兄台為何來救狄雲這不幸之人．", "talkname37", 0);
Talk(0, "我只是看這些禿子不爽，打著打著就打到這邊來了．", "talkname0", 1);
Talk(37, "那兄台還是趕緊離去，和我這不幸之人在一起，你會倒楣的．", "talkname37", 0);
Talk(0, "兄弟怎麼這麼說．雖說我是糊里糊塗的救到你，但出門在外，本應互相扶持的．", "talkname0", 1);
Talk(37, "可是．．可是．．", "talkname37", 0);
Talk(0, "你到底發生了什麼事，說來聽聽．", "talkname0", 1);
Talk(37, "幾年前，我隨師父和師妹到荊州去為我萬震山萬師叔祝壽，但後來卻被師叔他們誣賴我勾結盜匪，偷了他萬家的金銀珠寶，並意圖非禮小師娘．而縣府大人也沒明察秋毫，就把我關了起來．後來聽說我師父死了，我師妹．．．師妹她．．她．．竟嫁給了萬師兄．", "talkname37", 0);
Talk(0, "你很愛你師妹，是嗎？", "talkname0", 1);
Talk(37, "我師妹怎能．．．．．．．怎能嫁給那個姓萬的．", "talkname37", 0);
Talk(0, "那你後來怎麼離開那荊州大牢，又怎麼被關在這裡？", "talkname0", 1);
Talk(37, "在獄中的幾年，同牢的丁典丁大哥告訴了我許多江湖上的事，也教了我”神照經”大法，說是可以提昇內力．突然有一天，丁大哥帶我逃獄，說要去看一位朋友．但想不到是丁大哥的紅粉知己死了，而她父親，也就是荊州府尹，居然在她女兒的棺木上下毒，為的就是要害死丁大哥，丁大哥後來就中毒死了．而我雖然逃走了，但是後來又被這些番僧給捉了來，關在這兒．你看我是不是個不幸之人，跟我在一起的全都沒有好下場．", "talkname37", 0);
Talk(0, "快別這麼說，你只是比較”衰”而已．今後你有什麼打算嗎？", "talkname0", 1);
Talk(37, "我只想回老家湘西麻溪鋪去看看．我還記得那裡有個山洞，是我和師妹以前兒時常去玩的地方．", "talkname37", 0);
Talk(0, "那裡好玩嗎？改天我也去看看．", "talkname0", 1);
Talk(37, "那裡不好找的，平常人都不知道．我記得路旁有個石頭，寫著幾個數字”３６４２７９”的，蠻新鮮的．", "talkname37", 0);
ModifyEvent(-2, -2, -2, -2, 600, -1, -1, -2, -2, -2, -2, -2, -2);
if AskJoin () == true then goto label0 end;
    do return end;
::label0::
    Talk(0, "這樣好了，你要不要和我一起走，路上也有個照應．", "talkname0", 1);
    if JudgeEthics(0, 60, 100) == true then goto label1 end;
        Talk(37, "不了！我這個不幸之人還是別害人的好．", "talkname37", 0);
        do return end;
::label1::
        if TeamIsFull() == false then goto label2 end;
            Talk(37, "你的隊伍已滿，我無法加入．", "talkname37", 0);
            do return end;
::label2::
            Talk(37, "好吧！如果你不怕被我這個不幸之人連累的話．", "talkname37", 0);
            DarkScence();
            ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|狄云加入队伍。场景08-编号08
            ModifyEvent(-2, 9, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(-2, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            jyx2_ReplaceSceneObject("", "NPC/狄云", ""); 
            LightScence();
            Join(37);
            AddEthics(3);
do return end;
