if UseItem(159) == true then goto label0 end;
    do return end;
::label0::
    AddEthics(2);
    AddItem(159, -1);
    Talk(112, "這．．這是可蘭經．各位，可蘭經拿回來了．．奉至仁慈的阿拉之名，一切讚頌，全歸阿拉，全世界的主，至仁至慈的主，報應日的君主．我們只崇拜祂，只求祂祐助，求祂引導我們上正路，祂所祜祐的路，不是受遣責者的路，也不是迷誤者的路．少俠，你將敝族聖物從奸人手中奪回，我和全族人向你說聲謝謝．", "talkname112", 0);
    Talk(0, "＜裝酷一點＞這沒什麼，找書本來就是我拿手的．", "talkname0", 1);
    Talk(112, "少俠也在找書？", "talkname112", 0);
    Talk(0, "是啊！有些書掉了，我就到處找找，終究會找到的．", "talkname0", 1);
    Talk(112, "我這有一本書，不知少俠有沒有在找這一本？", "talkname112", 0);
    Talk(0, "那一本書？", "talkname0", 1);
    Talk(112, "書名叫什麼來著．？對了，叫”書劍恩仇錄”．", "talkname112", 0);
    Talk(0, "什麼？”書劍恩仇錄”在你這裡，這正是我要找的其中一本．", "talkname0", 1);
    Talk(112, "是嗎？這本書是陳公子送我的，他說沒什麼好看，就擺在我這邊．你要，就拿去好了．", "talkname112", 0);
    Talk(0, "什麼？太酷了吧，這本書居然隨意亂丟．＜哼！那個姓陳的看得懂才有鬼，耍帥！＞", "talkname0", 1);
    Talk(112, "提起這個，我就想起了陳公子，他說事情辦完要來看我的，怎麼這麼久還沒來．", "talkname112", 0);
    Talk(0, "＜哇！我沒望了．難道我比不上他的酷嗎？＞", "talkname0", 1);
    Talk(112, "少俠旅遊各地，若有遇到一名叫陳家洛的人，麻煩告訴他，就說翠羽黃衫在等他．", "talkname112", 0);
    Talk(0, "好．好．我會記得．＜會講才怪＞", "talkname0", 1);
    Talk(112, "那少俠多保重．", "talkname112", 0);
    GetItem(152, 1);
    ModifyEvent(-2, -2, -2, -2, 623, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本623。场景17
    ModifyEvent(-2, 1, -2, -2, 626, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本626。场景17-编号1
    ModifyEvent(-2, 2, -2, -2, 626, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本626。场景17-编号2
do return end;
