Talk(112, "這位少俠，遠道而來，不知有何貴事．", "talkname112", 0);
Talk(0, "＜哇！這馬子正點＞哦！沒什麼事，我等旅遊各地，為的是找幾本書，路過這裡，想進來碰碰運氣．不過剛剛進來時，好像聽他們在講，你們也在找書，叫什麼．．", "talkname0", 1);
Talk(112, "是我回族聖物可蘭經．此書是本族祖傳之物，得自回教聖地麥加，數十代都是由首領珍重保管，乃本族聖物．不料前些日子金輪法王趁我父親遠出之際，竟將經書搶了過去，說要獻給朝廷，以此為挾，控制我回人．因此我率領了本族勇士，想從金輪法王那兒將經書搶奪回來，但那傢伙實在太厲害了，三番兩次都被他打了回來.", "talkname112", 0);
Talk(0, "是嗎？此事包在我身上．我替姑娘將那可蘭經要回來．", "talkname0", 1);
Talk(112, "少俠若肯幫忙，我霍青桐代全族人向少俠謝謝．但還請少俠小心，那和尚功夫厲害的緊．", "talkname112", 0);
Talk(0, "＜為妳赴湯蹈火在所不惜＞我會小心的．", "talkname0", 1);
ModifyEvent(-2, -2, -2, -2, 621, 622, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本621,622。场景17-编号0
ModifyEvent(-2, 1, -2, -2, 625, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本625。场景17-编号1
ModifyEvent(-2, 2, -2, -2, 625, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本621,622。场景17-编号2
jyx2_ReplaceSceneObject("16", "NPC/jinlunfawang", "1");--金轮法王出现
ModifyEvent(16, 2, 1, 1, -1, -1, -1, 6812, 6812, 6812, -2, -2, -2);--by fanyu|改变贴图。场景16-编号2
ModifyEvent(16, 3, 1, 1, 631, -1, -1, 6814, 6814, 6814, -2, -2, -2);--by fanyu|改变贴图，启动脚本631。场景16-编号3
ModifyEvent(16, 4, 1, 1, -1, -1, -1, 6816, 6816, 6816, -2, -2, -2);--by fanyu|改变贴图。场景16-编号4
ModifyEvent(16, 5, -2, -2, 633, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本631。场景16-编号5
ModifyEvent(16, 6, -2, -2, 633, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本631。场景16-编号6
ModifyEvent(16, 7, -2, -2, 633, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本631。场景16-编号7
ModifyEvent(16, 8, -2, -2, 633, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本631。场景16-编号8
ModifyEvent(16, 9, -2, -2, 633, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本631。场景16-编号9
ModifyEvent(16, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|移除角色。场景16-编号10
ModifyEvent(16, 11, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|移除角色。场景16-编号11
jyx2_ReplaceSceneObject("16", "NPC/NPC 10", "");--金轮法王小弟换位置
jyx2_ReplaceSceneObject("16", "NPC/NPC 10 (1)", "1");--金轮法王小弟换位置
jyx2_ReplaceSceneObject("16", "NPC/NPC 11", "");--金轮法王小弟换位置
jyx2_ReplaceSceneObject("16", "NPC/NPC 11 (1)", "1");--金轮法王小弟换位置
ModifyEvent(16, 12, 1, 1, 633, -1, -1, 6758, 6758, 6758, -2, -2, -2);--by fanyu|启动脚本633，修改贴图。场景16-编号12
ModifyEvent(16, 13, 1, 1, 633, -1, -1, 6758, 6758, 6758, -2, -2, -2);--by fanyu|启动脚本633，修改贴图。场景16-编号13
ChangeMMapMusic(3);
do return end;
