Talk(0, "想不到在這沒什麼人煙的地方，你們客棧生意還這麼的好？", "talkname0", 1);
Talk(106, "那可不．要知方圓百里之內，只有我們這間客棧．你若不想凍死在這東北雪地裡，就必須在本店裡歇上一歇再走．怎麼，這位公子不遠千里來到這東北雪地中，是為了向”北丑”尋求解惑呢？還是去找那”狐狸”要書的呢？", "talkname106", 0);
Talk(0, "北丑？狐狸？", "talkname0", 1);
Talk(106, "是啊！會來我們這的，要不是想跟北丑那瘋子要些線索，打聽一些武林中的秘密．要不就是找那外號”雪山飛狐”的胡斐打架，奪取”十四天書”．江湖中人都盛傳著，”雪山飛狐”一書肯定在他那，否則他怎麼以此做為外號．", "talkname106", 0);
Talk(0, "小二哥，你知道的還真多．", "talkname0", 1);
Talk(106, "那當然，要不然怎麼會叫做小二哥呢？好，今天小二哥高興，多告訴你一些．那北丑住的地方，是在本店的西北方，而胡斐則是住在東北方．不過你得小心點，最近有很多居民在山中無緣無故走失了，傳說是雪怪出來作亂．", "talkname106", 0);
Talk(0, "謝謝你的忠告．", "talkname0", 1);
do return end;
