Talk(79, "我說老五啊，天氣這麼冷，喝這烈酒雖能驅寒，但如能再配上熱騰騰的兔肉，那才真是夠味呢．", "talkname79", 0);
Talk(79, "四哥，在這寒天雪地中，上那找兔肉去？", "talkname79", 4);
Talk(79, "誰說沒有兔子，只是我們功夫不濟，抓不到罷了．我曾聽人家說，在極北之地有一個很厲害的獵戶，輕功極高，在這雪地上獵兔，猶如獵鷹般的快，狠，準．", "talkname79", 0);
Talk(79, "那還等什麼，我們這就上他　家去要點兔肉來吃．", "talkname79", 4);
Talk(79, "你想上他家？我看要等到下輩子了．你知道他住那嗎？他住的地方叫”雲鶴崖”，輕功不到家的人根本就上不去．", "talkname79", 0);
Talk(79, "雲鶴崖？他該不會是．．．．", "talkname79", 4);
Talk(79, "沒錯，四大惡人之一的雲中鶴．", "talkname79", 0);
Talk(79, "那．．．那我們還是喝酒就好了．", "talkname79", 4);
do return end;
