Talk(85, "小六子，你知不知道附近有什麼好玩的．", "talkname85", 0);
Talk(85, "三師兄，這次咱們來到這江南，少不得要上那杭州西湖玩一玩．古人不是說，上有天堂，下有蘇杭嗎？更何況江南的美女是出了名的．", "talkname85", 4);
Talk(85, "你要上西湖玩，我問你對那邊瞭解多少．你知道那裡有什麼武林同道嗎？", "talkname85", 0);
Talk(85, "小六子見聞淺薄，還請師兄開導．", "talkname85", 4);
Talk(85, "我告訴你，蘇杭一帶最有名的便是姑蘇慕容家了．江湖上人談的”南慕容，北喬峰”，其中北喬峰指的是丐幫幫主，而南慕容指的就是姑蘇慕容家的慕容復了．你們應該聽說過姑蘇慕容家的絕技吧．", "talkname85", 0);
Talk(85, "”以彼之道，還施彼身”！", "talkname85", 4);
Talk(85, "沒錯．聽說姑蘇慕容家藏書豐富，熟知天下武功，最擅長的就是以對方最厲害的功夫去殺害對方，令對手到死之前還不能相信這個事實．", "talkname85", 0);
Talk(85, "那我們還是別亂玩好了，否則被他來個”泰山十八盤”劍法就糗大了．", "talkname85", 4);
do return end;
