Talk(0, "哇，真香．流浪在外這麼久，聞到這味道，不禁懷念起媽媽來了．", "talkname0", 1);
Talk(75, "小兄弟，別客氣．想吃什麼就跟我林廚子說一聲．", "talkname75", 0);
Talk(0, "老伯伯，你煮的菜好像都很好吃耶，聞起來都很香．", "talkname0", 1);
Talk(75, "其實啊，做菜沒什麼秘訣，只要有著一顆為食用者著想的心即可．", "talkname75", 0);
Talk(0, "”為食用者著想的心”？＜聽起來好像料理漫畫中的名言＞", "talkname0", 1);
Talk(75, "是的．一個廚師不能只想到要將自己的菜做得多色香味俱全，而應該想著是什麼人要吃你這道菜，怎樣的口味是最適合他，而去調理．因為這道菜終究是要給人吃的，而不是拿來觀賞或評論的．總之，就是在做菜的時候，就要儘可能的為食用者去著想．", "talkname75", 0);
Talk(0, "那林師父最擅長的拿手菜是什麼？", "talkname0", 1);
Talk(75, "一時也說不盡．比如說是炒白菜啦，蒸豆腐啦，燉雞蛋啦，白切肉．．", "talkname75", 0);
Talk(0, "可是聽起來好像都是一些很平常的菜肴．", "talkname0", 1);
Talk(75, "年輕人，要知真正的烹調高手，愈是在平凡的菜肴中，愈能顯出真實的本領．你也是學武的吧，其實這道理跟武學一般，能在平淡之中現神奇，才說得上是大宗匠的手段．", "talkname75", 0);
Talk(0, "．．．．．．", "talkname0", 1);
Talk(75, "你好好想一想吧．想通了對你武學也是大有助益．", "talkname75", 0);
ModifyEvent(-2, -2, -2, -2, 674, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本674 场景32-编号0
AddAptitude(0, 3);
do return end;
