Talk(0, "林師父，有件事能不能請你幫個忙．", "talkname0", 1);
Talk(75, "什麼事？", "talkname75", 0);
Talk(0, "有道菜不知你聽過沒，能不能幫我作一下．", "talkname0", 1);
Talk(75, "那道菜？", "talkname75", 0);
Talk(0, "”玉笛誰家聽落梅”．", "talkname0", 1);
Talk(75, "”玉笛誰家聽落梅”，這不是桃花島的招牌菜嗎．嗯，做這道菜是有點麻煩，不過還難不倒我．", "talkname75", 0);
Talk(0, "真的！", "talkname0", 1);
Talk(75, "不過，這菜需要的材料蠻多的，我這邊現在也沒有．", "talkname75", 0);
Talk(0, "什麼材料，我幫你找去．", "talkname0", 1);
Talk(75, "好，仔細聽著．第一樣材料是羊羔坐臀．第二樣材料是小豬耳朵．第三樣材料是小牛腰子．第四樣材料是獐腿肉．最後一樣材料是兔肉．總共五種材料．你如果找齊這五種材料後，我就可以幫你作出”玉笛誰家聽落梅”這道菜了．", "talkname75", 0);
ModifyEvent(-2, -2, -2, -2, 676, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本676 场景32-编号0
do return end;
