Talk(11, "不知小兄弟是那派的高徒，其他五派的人呢？", "talkname11", 0);
Talk(0, "在下並非六大派的人，此次前來明教是想打聽一本書的下落．", "talkname0", 1);
Talk(11, "是”倚天屠龍記”吧？", "talkname11", 0);
Talk(0, "江湖上傳言果然非假，”倚天屠龍記”一書果然在明教中．不知前輩可否借小弟一用．", "talkname0", 1);
Talk(11, "借你一用．哼！你沒將明教光明左使楊逍瞧在眼裡，是不是仗著我明教大難之際來撿現成便宜？", "talkname11", 0);
Talk(0, "事情並非如此，實在是這本書對我十分重要，我非得到它不可．", "talkname0", 1);
Talk(11, "那我就先把你解決再說，免得六大派攻來後被你混水摸魚了．", "talkname11", 0);
Talk(0, "我並不是來與明教為難的，楊左使還是留點氣力對付六大派好了．", "talkname0", 1);
Talk(11, "對付你倒也不用花費什麼力氣．出招吧！", "talkname11", 0);
if TryBattle(9) == true then goto label0 end;
    Dead();
    do return end;
::label0::
    ModifyEvent(-2, 4, -2, -2, -1, -1, -1, 5308, 5308, 5308, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号4
    ModifyEvent(-2, 5, -2, -2, -1, -1, -1, 5310, 5310, 5310, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号5
    ModifyEvent(-2, 6, -2, -2, -1, -1, -1, 5312, 5312, 5312, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号6
    ModifyEvent(-2, 7, -2, -2, -1, -1, -1, 5314, 5314, 5314, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号7
    ModifyEvent(-2, 8, -2, -2, -1, -1, -1, 5312, 5308, 5312, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号8
    ModifyEvent(-2, 9, -2, -2, -1, -1, -1, 5310, 5310, 5310, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号9
    ModifyEvent(-2, 10, 1, 1, -1, -1, -1, 5298, 5298, 5298, -2, -2, -2);--by fanyu|战斗后成昆出现。场景12-编号10
    jyx2_ReplaceSceneObject("", "NPC/chengkun", "1");--成昆出现
    LightScence();
    Talk(0, "楊左使，我就說了嘛，跟我打很耗力氣的．", "talkname0", 1);
    Talk(11, "你．．．．．．", "talkname11", 0);
    Talk(18, "哈！哈！哈！打的好，打的好．", "talkname18", 0);
    Talk(0, "那裡來的賊禿在那鬼吼鬼叫的．", "talkname0", 1);
    Talk(11, "你是誰？是怎麼混進我明教的？", "talkname11", 0);
    Talk(18, "你問我成崑怎麼進來的？當然是大搖大擺走進來的．還多虧了這小朋友，替我省下一番功夫．", "talkname18", 0);
    Talk(11, "你是混元霹靂手成崑，謝法王的師父？", "talkname11", 0);
    Talk(18, "沒錯，我就是那頭笨獅的師父．拜他的魯莽所賜，你們和六大派結下了這麼多樑子．　　　　　　　　　　　今天起明教就將化為灰燼，也了結了我多年來的心願．", "talkname18", 0);
    Talk(0, "要是我猜的沒錯，這中間的一切都是你苦心安排的．", "talkname0", 1);
    Talk(18, "你這小子倒還蠻聰明的嘛．沒錯，激起謝遜的憤怒，讓他到處亂殺人，留下我的名字好激我現身，到最後再故意讓江湖人知道其實是明教謝遜所為，引起江湖各大派與明教間仇殺，這一切都是我精心計畫的．", "talkname18", 0);
    Talk(11, "你為何要如此做？", "talkname11", 0);
    Talk(18, "要問就去問你們前任教主陽頂天．我原本一樁美好的姻緣卻被他活生生拆散了，明明是我愛妻，只因他當上了魔教的大頭子，就將我愛妻霸佔了去．因此我心中便立下重誓：只要我成崑還有一口氣在，定要讓魔教永無寧日．我立下此誓已有二十餘年，今日方見大功告成．哈哈！現下六大派應該已攻下總壇光明頂了吧．", "talkname18", 0);
    Talk(11, "什麼！那我得快點趕回光明頂．", "talkname11", 0);
    Talk(18, "不用趕回去死了，你死在這就可以了．", "talkname18", 0);
    Talk(0, "喂！老禿驢，你們這些惡人怎麼每次都喜歡將自己的壞勾當講出來．是不是以為我們這些好人都會死掉，無法揭發你的陰謀？楊左使，你先趕回光明頂，這個禿驢交給我好了，讓他嚐嚐多嘴的後果．", "talkname0", 1);
    Talk(18, "哼！就憑你．", "talkname18", 0);
    Talk(11, "你．．你．．真的行嗎？", "talkname11", 0);
    Talk(0, "別忘了，如果連我也不行的話，那你可能更慘哦！快去吧，我隨後就到．", "talkname0", 1);
    jyx2_ReplaceSceneObject("", "NPC/yangxiao", "");--杨逍离开去光明顶
    AddRepute(4);
    if TryBattle(10) == true then goto label1 end;
        Dead();
        do return end;
::label1::
        ModifyEvent(-2, 4, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号4
        ModifyEvent(-2, 5, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号5
        ModifyEvent(-2, 6, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号6
        ModifyEvent(-2, 7, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号7
        ModifyEvent(-2, 8, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号8
        ModifyEvent(-2, 9, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号9
        ModifyEvent(-2, 0, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号0
        ModifyEvent(-2, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号10
         jyx2_ReplaceSceneObject("", "NPC/NPC2 (1)", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC4 (1)", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC3 (1)", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC2 (2)", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC4 (2)", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC3 (2)", "");--明教教徒离开去光明顶
        jyx2_ReplaceSceneObject("", "NPC/chengkun", "");--成昆从地道逃跑
        
        ModifyEvent(-2, 11, 1, 1, 80, -1, -1, 5310, 5310, 5310, -2, -2, -2);--by fanyu|生成人物，启动80号脚本。场景12-编号11
        jyx2_ReplaceSceneObject("", "NPC/chuzi", "1");--厨子出来
        SetScenceMap(-2, 1, 28, 24, 0);--by fanyu|明教地道的门打开。场景12-坐标28,24
        
        LightScence();
        
        Talk(0, "這老賊溜的倒快，沒時間追他了，我得趕快趕去光明頂才是．", "talkname0", 1);
        
        AddRepute(3);
        ChangeMMapMusic(3);
       
do return end;
