Talk(74, "少年哎，到這寒天雪地中，是向我”李丑”尋求真理的嗎？", "talkname74", 0);
Talk(0, "＜李丑？莫非他就是與智者齊名，”南賢北丑”中的北丑嗎 ？＞＜怎麼看起來瘋瘋癲癲的，罩得住嗎？＞", "talkname0", 1);
Talk(74, "別懷疑我的能力？", "talkname74", 0);
Talk(0, "＜厲害！連我在想什麼都知道．＞你真的懂得很多嗎？有比”南賢”智者還多嗎？", "talkname0", 1);
Talk(74, "南賢那個老頭子懂什麼？他知道的不過是基本知識罷了，連三歲小孩子都知道．我李丑可就不一樣了，我知道的可都是武林中的大秘密哦！所以別浪費你的智慧果了，拿來給我還比較實際一點．你如果還不相信我的能力，那我就讓你見識我這全江湖中唯一的一件法寶.看到桌上的水晶球沒，沒事就摸它一下，看看有什麼意想不到的事發生．", "talkname74", 0);
ModifyEvent(-2, -2, -2, -2, 827, 751, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 2, -2, -2, 828, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
