Talk(0, "哇！這裡這麼多人，幹什麼這麼熱鬧，可少不了小俠我．我說名門正派又怎麼樣，還不是一樣趕盡殺絕，跟魔教又有什麼兩樣，只不過藉口好聽一點罷了．", "talkname0", 1);
Talk(14, "都是你這個兔崽子，打傷了鷹王和我，", "talkname14", 0);
Talk(11, "還有我．", "talkname11", 0);
Talk(14, "害我們只剩下范右使應戰，寡不敵眾．．．．．", "talkname14", 0);
Talk(0, "既然如此，我就幫你們打發這些人，當是陪罪好了．", "talkname0", 1);
Talk(70, "少俠非魔教人士，還請速速離去，以免受池魚之殃．", "talkname70", 0);
Talk(0, "那好，大家都別打了，因為這中間著實有許多誤會，讓我好好說給你們聽．", "talkname0", 1);
Talk(6, "現在年輕人都這麼狂妄嗎？你自以為是武林盟主嗎！要我們聽你說．", "talkname6", 0);
Talk(8, "你這小賊，跟魔教勾結，想要拖延時間，好施什麼詭計麼？先殺了你再說．", "talkname8", 0);
Talk(0, "我就知道要你們安安靜靜聽我說是不太可能，那只有想辦法讓你們服氣了．一起來吧，這樣比較省事．", "talkname0", 1);
Talk(6, "好狂妄的口氣．", "talkname6", 0);
Talk(70, "阿彌陀佛．", "talkname70", 0);
if TryBattle(12) == true then goto label0 end;
    Dead();
    do return end;
::label0::
    ModifyEvent(-2, 12, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-12
    ModifyEvent(-2, 14, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-14
    ModifyEvent(-2, 15, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-15
    ModifyEvent(-2, 16, 0, 0, -1, -1, -1, 5434, 5434, 5434, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-16
    ModifyEvent(-2, 17, 0, 0, -1, -1, -1, 5432, 5432, 5432, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-17
    ModifyEvent(-2, 18, 0, 0, -1, -1, -1, 5434, 5434, 5434, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-18
    ModifyEvent(-2, 20, 0, 0, -1, -1, -1, 5428, 5428, 5428, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-20
    ModifyEvent(-2, 21, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-21
    ModifyEvent(-2, 22, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-22
    ModifyEvent(-2, 23, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-23
    ModifyEvent(-2, 24, 0, 0, -1, -1, -1, 5428, 5428, 5428, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-24
    ModifyEvent(-2, 25, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-25
    ModifyEvent(-2, 26, 0, 0, -1, -1, -1, 5430, 5430, 5430, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-26
    ModifyEvent(-2, 27, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-27
    ModifyEvent(-2, 29, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-29
    ModifyEvent(-2, 32, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-32
    ModifyEvent(-2, 33, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-33
    ModifyEvent(-2, 34, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-34
    ModifyEvent(-2, 35, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-35
    ModifyEvent(-2, 38, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-38
    ModifyEvent(-2, 39, 0, 0, -1, -1, -1, 5446, 5446, 5446, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-39
    ModifyEvent(-2, 40, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-40
    ModifyEvent(-2, 41, 0, 0, -1, -1, -1, 5444, 5444, 5444, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-41
    ModifyEvent(-2, 42, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-42
    ModifyEvent(-2, 43, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-43
    ModifyEvent(-2, 44, 0, 0, -1, -1, -1, 5444, 5444, 5444, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-44
    ModifyEvent(-2, 45, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-45
    ModifyEvent(-2, 46, 0, 0, -1, -1, -1, 5446, 5446, 5446, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-46
    ModifyEvent(-2, 48, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-48
    ModifyEvent(-2, 51, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-51
    ModifyEvent(-2, 52, 0, 0, -1, -1, -1, 5436, 5436, 5436, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-52
    ModifyEvent(-2, 53, 0, 0, -1, -1, -1, 5438, 5438, 5438, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-53
    ModifyEvent(-2, 54, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-54
    ModifyEvent(-2, 55, 0, 0, -1, -1, -1, 5436, 5436, 5436, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-55
    ModifyEvent(-2, 56, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-56
    ModifyEvent(-2, 58, 0, 0, -1, -1, -1, 5442, 5442, 5442, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-58
    ModifyEvent(-2, 59, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-59
    ModifyEvent(-2, 60, 0, 0, -1, -1, -1, 5440, 5440, 5440, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-60
    ModifyEvent(-2, 61, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-61
    ModifyEvent(-2, 62, 0, 0, -1, -1, -1, 5442, 5442, 5442, -2, -2, -2);--by fanyu|改变贴图，战斗胜利。场景11-62
    ModifyEvent(-2, 63, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|战斗胜利，贴图消失。场景11-63
    LightScence();
    Talk(0, "如何？現在肯安靜地聽我說了吧．事情的經過是這樣的．．．如此如此．．．．．．．．這般這般．．．．．．．．總之，一切的陰謀，都是成崑那奸賊所計劃的．所以我說呢，你們兩方還是握手言和吧，反正明教殺過六大派的人，六大派也殺過明教的人，大家半斤八兩，差不了多少，就都罷手吧．", "talkname0", 1);
    Talk(8, "話都是你在說的，是不是真的，我們怎麼知道．", "talkname8", 0);
    Talk(6, "哼！技不如人，說這麼多做什麼，走吧！", "talkname6", 0);
    Talk(70, "阿彌陀佛，盼少俠以後多所規勸引導，總要使明教改邪歸正，少做壞事．我們走吧．", "talkname70", 0);
    jyx2_ReplaceSceneObject("", "NPC/huashanpai", "");--华山派离开
    jyx2_ReplaceSceneObject("", "NPC/xuanci", "");--玄慈离开
    jyx2_ReplaceSceneObject("", "NPC/emeipai", "");--峨嵋派离开
    jyx2_ReplaceSceneObject("", "NPC/emeipai1", "");
    jyx2_ReplaceSceneObject("", "NPC/hetaichong", "");--何太冲离开
    jyx2_ReplaceSceneObject("", "NPC/kunlun1", "");
    jyx2_ReplaceSceneObject("", "NPC/kunlun2", "");
    jyx2_ReplaceSceneObject("", "NPC/tangwenliang", ""); --崆峒派离开
    jyx2_ReplaceSceneObject("", "NPC/kunlunpai", "");
    DarkScence();
    ModifyEvent(-2, 7, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|贴图消失。场景11-以下都是
    ModifyEvent(-2, 8, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 9, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 11, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 12, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 13, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 14, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 15, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 16, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 17, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 18, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 19, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 20, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 21, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 22, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 23, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 24, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 25, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 26, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 27, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 28, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 29, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 30, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 31, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 32, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 33, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 34, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 35, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 36, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 37, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 38, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 39, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 40, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 41, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 42, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 43, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 44, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 45, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 46, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 47, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 48, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 49, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 50, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 51, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 52, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 53, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 54, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 55, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 56, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 57, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 58, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 59, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 60, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 61, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 62, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 63, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 64, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 65, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 66, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 67, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 68, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 69, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 70, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 79, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 80, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 81, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 82, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 83, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 84, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 96, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 97, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 98, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    ModifyEvent(-2, 99, 0, 0, -1, -1, 89, -1, -1, -1, -2, -2, -2);--by fanyu|启动脚本-89。场景11-99
    ModifyEvent(-2, 3, 1, 1, 83, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-83改变对话。场景11-3
    ModifyEvent(-2, 4, 1, 1, 84, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-84改变对话。场景11-4
    ModifyEvent(-2, 5, 1, 1, 85, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-85改变对话。场景11-5
    ModifyEvent(-2, 6, 1, 1, 88, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-88改变对话。场景11-6
    ModifyEvent(-2, 77, 1, 1, 87, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-87改变对话。场景11-77
    ModifyEvent(-2, 78, 1, 1, 87, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-87改变对话。场景11-78
    SetScencePosition2(29, 34);
    LightScence();
    jyx2_ReplaceSceneObject("", "NPC/weiyixiao", "1");--韦一笑出现
    jyx2_ReplaceSceneObject("", "NPC/yangxiao", "1");--杨逍出现
    jyx2_ReplaceSceneObject("", "NPC/fanyao", "1");--范遥出现
    jyx2_ReplaceSceneObject("", "NPC/yintianzheng", "1"); --殷天正出现

    Talk(14, "小子，你還不賴嘛！", "talkname14", 0);
    Talk(10, "蝠王，不可無禮．明教全教下上，叩謝少俠護教救命的大恩！", "talkname10", 0);
    Talk(0, "快別這麼說，仗義行俠，本就是我輩中人應當做的．況且，這次也因為我的魯莽，害你們陷入苦戰．", "talkname0", 1);
    Talk(12, "那裡，是我們沒問清楚．", "talkname12", 0);
    Talk(14, "你們也別這麼客套了．這樣吧，大家聽我一言，我說呢，這位少俠武功蓋世義薄雲天，於本教有存亡續絕的大恩．咱們擁立他為本教第三十四任教主．由他來做教主，總比你來做教主好吧，楊左使，你說對不對啊．", "talkname14", 0);
    Talk(11, "是啊！這位少俠來做我們教主，也比你韋一笑來做好的多．", "talkname11", 0);
    Talk(14, "你．．．．", "talkname14", 0);
    Talk(10, "你們兩個別在那裡吵了，丟人現眼的．", "talkname10", 0);
    Talk(0, "不，不，在下我雖然一直夢想能當個什麼掌門教主的．但是我仍有要事在身，且跟你們是不同世界的人，所以你們還是另覓他人吧．", "talkname0", 1);
    Talk(10, "少俠如果一直推卻不肯，我們明教恐怕又要為此爭鬧不休，四分五裂，到時又會被其他門派圍攻，導致滅亡了．", "talkname10", 0);
    Talk(0, "我這裡有封陽教主的遺書，上面提到要謝遜謝法王暫代教主之職．我想你們還是先找到他再說吧．", "talkname0", 1);
    Talk(10, "哦！真是如此，來人啊！即刻通令下去，全力尋找謝法王．", "talkname10", 0);
    Talk(0, "另外還有一件事拜託你們，你們明教中是否有一本叫”倚天屠龍記”的書？是否能借我一下．", "talkname0", 1);
    Talk(10, "有的．陽教主曾對我提過，我們教中有一本奇書，是我明教鎮教之寶，皆由歷代教主相傳而下．", "talkname10", 0);
    Talk(0, "是嗎？真的有．皇天不負苦心人，打了這麼多場仗，終於讓我找到了．", "talkname0", 1);
    Talk(10, "可是，這本書因為陽教主的突然消失，其下落也無人知道了．", "talkname10", 0);
    Talk(12, "少俠別擔心，等我們找到謝法王，整頓好教務後，必當全力搜尋此書的下落．若有消息，定當告之少俠．", "talkname12", 0);
    Talk(0, "好吧，也只有這樣了．我有空也會幫你們找找謝前輩，在下這就告辭了．", "talkname0", 1);
    Talk(10, "這裡有塊鐵燄令，是我明教的信物．少俠在江湖上行走，若有什麼困難需要我明教幫忙的時後，只須出示這塊鐵燄令，我明教全體教眾一定全力相助．", "talkname10", 0);
    GetItem(190, 1);
    AddEthics(10);
    AddRepute(15);
do return end;
