Talk(111, "來，來．來．來看看有什麼需要的，我這應有盡有．這位小哥，看看有什麼需要的，我小寶賣的東西價錢絕對公道．", "talkname111", 0);
Talk(0, "哇！你這好多東西．小寶兄，你真有辦法．", "talkname0", 1);
Talk(111, "那裡那裡，小爺過獎了．我的功夫不好，要在這江湖上混，只得想辦法到處弄點好東西，在各地客棧兜售，以此維生．", "talkname111", 0);
Talk(0, "不知兄台如何稱呼？", "talkname0", 1);
Talk(111, "我叫韋．．．別這麼彆忸，你就叫我小寶好了．記著，如果有什麼需要的，到各地的客棧找我就對了．不過我不一定會待在那個客棧，你得碰碰運氣．", "talkname111", 0);
ModifyEvent(-2, -2, -2, -2, 938, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 17, 0, 0, -1, -1, 939, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 18, 0, 0, -1, -1, 939, -1, -1, -1, -2, -2, -2);
do return end;
