Talk(16, "多謝少俠救了內人，胡某不知該如何報答．", "talkname16", 0);
Talk(0, "沒什麼，幫助別人本就是件快樂的事，胡先生就別客氣了．只是，我看金花婆婆也不像壞人．", "talkname0", 1);
Talk(16, "其實，都怪我夫婦年輕時的比試，誤了不少上門求醫的人．", "talkname16", 0);
Talk(0, "比試？", "talkname0", 1);
Talk(16, "我夫婦原本是同門師兄妹，所學各有不同．我是學醫，這你知道的．拙荊則是學毒的，使毒能力之高，江湖上人還封她一個外號，叫做”毒仙”．那時我因為年輕衝動，救了一些被拙荊下過毒的人，使得江湖上傳言我這個醫仙比毒仙厲害許多．後來拙荊一怒之下，便到處下毒要與我比試，看我能不能救活他們．但我總覺得這樣下去不行，於是就立了個誓，”非我明教之人不救”我想這樣拙荊就無法再與我比試，因為我倆都是明教中人，拙荊萬萬不會對自己教中的兄弟下手．", "talkname16", 0);
Talk(0, "這麼說來，因為那位銀葉先生不是你明教中人，所以你就沒救他了．", "talkname0", 1);
Talk(16, "正是．", "talkname16", 0);
Talk(17, "師兄，這次我們可能失算了．在我被抓到靈蛇島日子中，我無意間發現這金花婆婆可能是我明教中人，而且輩份不低，是四大護法之首．", "talkname17", 0);
Talk(16, "妳是說，她是紫衫龍王！可是不對呀，我聽人家說，紫衫龍王是明教第一美女，怎麼可能長的如此．", "talkname16", 0);
Talk(17, "只怕她有不得已的苦衷，故意化妝成這樣．", "talkname17", 0);
Talk(16, "這樣看來，我竟害了自己教中的弟兄．唉，從今以後，我這”非明教中人不治”的原則就當沒說過．行醫本就是要來救人，否則學醫幹嘛．對了，聽說少俠正在旅遊各　地，尋找一些東西．江湖多風險，我夫婦二人擅長一些醫術，毒術或許能幫上少俠一些忙也說不定．", "talkname16", 0);
Talk(17, "是啊，如果少俠有需要的話儘管說，我夫婦二人一定樂意效勞．蝴蝶谷內若有少俠需要的東西，也請少俠自行取用．", "talkname17", 0);
ModifyEvent(-2, 0, -2, -2, 96, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 1, -2, -2, 97, -1, -1, -2, -2, -2, -2, -2, -2);
Add3EventNum(73, 2, 0, 0, 55)
if JudgeEventNum(3, -1) == true then goto label0 end;
    ModifyEvent(-2, 3, -2, -2, 903, -1, -1, -2, -2, -2, -2, -2, -2);
::label0::
    if JudgeEventNum(4, -1) == true then goto label1 end;
        ModifyEvent(-2, 4, -2, -2, 904, -1, -1, -2, -2, -2, -2, -2, -2);
::label1::
        if JudgeEventNum(5, -1) == true then goto label2 end;
            ModifyEvent(-2, 5, -2, -2, 905, -1, -1, -2, -2, -2, -2, -2, -2);
::label2::
do return end;
