Talk(43, "小子，你怎么还活着？你没去侠客岛吗？", "talkname43", 0);
Talk(0, "去过了！侠客岛上其实并不像外界所传言的那么可怕。岛上其实藏有极大的武功秘密，许多掌门都是沉迷于武功的钻研上，才一直没有回到中土，并不是遭到杀害。事情的经过是这样的……", "talkname0", 1);
Talk(43, "什么！有这等事！那这么说来，你学到侠客神功啰。快将武功秘笈交出来，否则要你好看。", "talkname43", 0);
Talk(0, "呦，翻脸不认人啦！当初还很高兴我替上侠客岛送死，如今却……", "talkname0", 1);
Talk(43, "废话少说。", "talkname43", 0);
if TryBattle(60) == true then goto label0 end;
    Dead();
    do return end;
::label0::
    LightScence();
    ModifyEvent(-2, 5, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 6, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 7, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 8, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 9, -2, -2, 346, -1, -1, -2, -2, -2, -2, -2, -2);
    AddRepute(3);
do return end;
