Talk(0, "前辈，我送你的玉蜂浆很有用吧。", "talkname0", 1);
Talk(64, "你的玉蜂浆固然有用，但我养蜂的本事更是高强。", "talkname64", 0);
Talk(0, "哦？", "talkname0", 1);
Talk(64, "你没看，我培养出一批天下无双，人间罕见的异种来，当真是巧夺天工，造化之奇也无如此奇法。", "talkname64", 0);
Talk(0, "不知是怎样的奇法？", "talkname0", 1);
Talk(64, "小兄弟，我且问你。人是万物之灵，身上有刺花刺字，或刺盘龙虎豹，或书天下太平。但除了人之外，禽兽虫蚁身上，可有刺字的？", "talkname64", 0);
Talk(0, "虎有黄斑，豹有金钱，至于蝴蝶毒蛇，身上花纹更奇于刺花百倍。", "talkname0", 1);
Talk(64, "但你见过虫蚁身上有字的没有？", "talkname64", 0);
Talk(0, "你说是天生的么？那倒没见过。", "talkname0", 1);
Talk(64, "好，今天给你开一开眼界。仔细看看那些蜜蜂的翅膀。", "talkname64", 0);
Talk(0, "咦！真的有字。好像是“情谷底”三个字。", "talkname0", 1);
Talk(64, "看到没有。", "talkname64", 0);
Talk(0, "＜这字绝非天生，分明是有人故意刺成的。＞这哪是什么天下无双，人间罕见了，八成是你用绣花针刺上去的，对不对。", "talkname0", 1);
Talk(64, "你说什么？你再看看其他的蜜蜂。", "talkname64", 0);
Talk(0, "这……这，怎么每只都有。而且写的字都不太一样。这只写的是“我在绝”。", "talkname0", 1);
Talk(64, "我还看过别只上面写的是“二午寺”，还有“一山恶”的。你说，这全都是我写的吗？", "talkname64", 0);
Talk(0, "“情谷底”，“我在绝”，“二午寺”，“一山恶”……这到底是什么意思？前辈，这蜜蜂不是你自己养的吧！", "talkname0", 1);
Talk(64, "咦，你怎么知道？", "talkname64", 0);
Talk(0, "我胡乱猜的。", "talkname0", 1);
Talk(64, "这些蜜蜂是从北边山脉飞来的，起先我也吓了一大跳。", "talkname64", 0);
Talk(0, "我看这事有点怪异。", "talkname0", 1);
Talk(64, "看来你还是不服气的样子，你等着好了，我会养出更奇怪的蜜蜂来。", "talkname64", 0);
ModifyEvent(-2, 4, -2, -2, 406, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动406脚本。场景20-编号4
ModifyEvent(-2, 5, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号5
ModifyEvent(-2, 6, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号6
ModifyEvent(-2, 7, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号7
ModifyEvent(-2, 8, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号8
ModifyEvent(-2, 9, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号9
ModifyEvent(-2, 10, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号10
ModifyEvent(-2, 11, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号11
ModifyEvent(-2, 12, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号12
ModifyEvent(21, 1, 1, 1, 417, -1, -1, 6158, 6158, 6158, -2, -2, -2);--by fanyu|启动417脚本，改变贴图。场景21-编号01
jyx2_ReplaceSceneObject("21","NPC/yinggu","1");
ModifyEvent(21, 4, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(40, 9, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景40-编号09
ModifyEvent(40, 10, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景40-编号10
ModifyEvent(40, 11, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景21-编号11
ModifyEvent(40, 12, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景21-编号12
OpenScene(80);
do return end;
