Talk(64, "来来来，小兄弟，我教你一个好玩的游戏。", "talkname64", 0);
Talk(0, "什么游戏？", "talkname0", 1);
Talk(64, "我老顽童独创的“左右互搏之术”。这是当年我被黄老邪关在桃花岛十五年间，无聊时所创出的武功。要知在这十五年中，我苦无对手拆招，只好左手和右手打架。", "talkname64", 0);
Talk(0, "左手怎能和右手打架？", "talkname0", 1);
Talk(64, "我假装右手是黄老邪，左手是老顽童。右手一掌打去，左手拆开之后还了一拳，就这样打了起来。", "talkname64", 0);
Talk(0, "这功夫很难学吧？", "talkname0", 1);
Talk(64, "说难是难到极处，说容易也容易之至。有的人一辈子都学不会，有的人只需几天便会了。好像越是聪明，越是不成，看看你是否有这机缘看着了……第一课“左手画方，右手画圆”……", "talkname64", 0);
DarkScence();
LightScence();
Talk(64, "功夫是教你了，接下来就看你有没有这造化了。", "talkname64", 0);
AddItem(91, 1);
ModifyEvent(-2, -2, -2, -2, 413, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本413。场景20-编号04
ModifyEvent(21, 3, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);--by qige2016|关闭脚本432。场景21-编号03
do return end;
