Talk(0, "兄弟，你是谁，怎么会被关在这？", "talkname0", 1);
Talk(37, "兄台为何来救狄云这不幸之人。", "talkname37", 0);
Talk(0, "我只是看这些秃子不爽，打着打着就打到这边来了。", "talkname0", 1);
Talk(37, "那兄台还是赶紧离去，和我这不幸之人在一起，你会倒楣的。", "talkname37", 0);
Talk(0, "兄弟怎么这么说。虽说我是糊里糊涂的救到你，但出门在外，本应互相扶持的。", "talkname0", 1);
Talk(37, "可是……可是……", "talkname37", 0);
Talk(0, "你到底发生了什么事，说来听听。", "talkname0", 1);
Talk(37, "几年前，我随师父和师妹到荆州去为我万震山万师叔祝寿，但后来却被师叔他们诬赖我勾结盗匪，偷了他万家的金银珠宝，并意图非礼小师娘。而县府大人也没明察秋毫，就把我关了起来。后来听说我师父死了，我师妹……师妹她……她……竟嫁给了万师兄。", "talkname37", 0);
Talk(0, "你很爱你师妹，是吗？", "talkname0", 1);
Talk(37, "我师妹怎能……怎能嫁给那个姓万的。", "talkname37", 0);
Talk(0, "那你后来怎么离开那荆州大牢，又怎么被关在这里？", "talkname0", 1);
Talk(37, "在狱中的几年，同牢的丁典丁大哥告诉了我许多江湖上的事，也教了我“神照经”大法，说是可以提升内力。突然有一天，丁大哥带我逃狱，说要去看一位朋友。但想不到是丁大哥的红粉知己死了，而她父亲，也就是荆州府尹，居然在她女儿的棺木上下毒，为的就是要害死丁大哥，丁大哥后来就中毒死了。而我虽然逃走了，但是后来又被这些番僧给捉了来，关在这儿。你看我是不是个不幸之人，跟我在一起的全都没有好下场。", "talkname37", 0);
Talk(0, "快别这么说，你只是比较“衰”而已。今后你有什么打算吗？", "talkname0", 1);
Talk(37, "我只想回老家湘西麻溪铺去看看。我还记得那里有个山洞，是我和师妹以前儿时常去玩的地方。", "talkname37", 0);
Talk(0, "那里好玩吗？改天我也去看看。", "talkname0", 1);
Talk(37, "那里不好找的，平常人都不知道。我记得路旁有个石头，写着几个数字“３６４２７９”的，蛮新鲜的。", "talkname37", 0);--原版为２７０，１１５唐诗山洞
ModifyEvent(-2, -2, -2, -2, 600, -1, -1, -2, -2, -2, -2, -2, -2);
if AskJoin () == true then goto label0 end;
    do return end;
::label0::
    Talk(0, "这样好了，你要不要和我一起走，路上也有个照应。", "talkname0", 1);
    if JudgeEthics(0, 60, 100) == true then goto label1 end;
        Talk(37, "不了！我这个不幸之人还是别害人的好。", "talkname37", 0);
        do return end;
::label1::
        if TeamIsFull() == false then goto label2 end;
            Talk(37, "你的队伍已满，我无法加入。", "talkname37", 0);
            do return end;
::label2::
            Talk(37, "好吧！如果你不怕被我这个不幸之人连累的话。", "talkname37", 0);
            DarkScence();
            ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|狄云加入队伍。场景08-编号08
            ModifyEvent(-2, 9, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(-2, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            jyx2_ReplaceSceneObject("", "NPC/狄云", ""); 
            LightScence();
            Join(37);
            AddEthics(3);
do return end;
