Talk(91, "小子，金轮寺暂时封寺，你要参观就到别处。", "talkname91", 0);
Talk(0, "大爷我就爱到处逛逛，你们这些秃子管不着。", "talkname0", 1);
if TryBattle(99) == true then goto label0 end;
    Dead();
    do return end;
::label0::
    ModifyEvent(-2, 5, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动628脚本。场景16-编号5
    ModifyEvent(-2, 6, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动628脚本。场景16-编号6
    ModifyEvent(-2, 7, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动628脚本。场景16-编号7
    ModifyEvent(-2, 8, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动628脚本。场景16-编号8
    ModifyEvent(-2, 9, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动628脚本。场景16-编号9
    ModifyEvent(-2, 10, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动628脚本。场景16-编号10
    ModifyEvent(-2, 11, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动628脚本。场景16-编号11
    ModifyEvent(-2, 20, -2, -2, -1, -1, 629, -2, -2, -2, -2, -2, -2);--by fanyu|启动629脚本。场景16-编号20
    ModifyEvent(-2, 21, -2, -2, -1, -1, 629, -2, -2, -2, -2, -2, -2);--by fanyu|启动628脚本。场景16-编号21
    ModifyEvent(-2, 22, -2, -2, -1, -1, 629, -2, -2, -2, -2, -2, -2);--by fanyu|启动629脚本。场景16-编号22
    LightScence();
    AddRepute(1);
do return end;
