Talk(74, "少年哎，到这寒天雪地中，是向我“李丑”寻求真理的吗？", "talkname74", 0);
Talk(0, "＜李丑？莫非他就是与智者齐名，“南贤北丑”中的北丑吗？＞＜怎么看起来疯疯癫癫的，罩得住吗？＞", "talkname0", 1);
Talk(74, "别怀疑我的能力？", "talkname74", 0);
Talk(0, "＜厉害！连我在想什么都知道。＞你真的懂得很多吗？有比“南贤”智者还多吗？", "talkname0", 1);
Talk(74, "南贤那个老头子懂什么？他知道的不过是基本知识罢了，连三岁小孩子都知道。我李丑可就不一样了，我知道的可都是武林中的大秘密哦！所以别浪费你的智慧果了，拿来给我还比较实际一点。你如果还不相信我的能力，那我就让你见识我这全江湖中唯一的一件法宝。看到桌上的水晶球没，没事就摸它一下，看看有什么意想不到的事发生。", "talkname74", 0);
ModifyEvent(-2, -2, -2, -2, 827, 751, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 2, -2, -2, 828, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
