ModifyEvent(-2, 3, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|改变贴图为空。场景11-3
ModifyEvent(-2, 4, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|改变贴图为空。场景11-4
ModifyEvent(-2, 5, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|改变贴图为空。场景11-5
ModifyEvent(-2, 6, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|改变贴图为空。场景11-6
jyx2_ReplaceSceneObject("", "NPC/yangxiao", "");
jyx2_ReplaceSceneObject("", "NPC/fanyao", ""); 
jyx2_ReplaceSceneObject("", "NPC/yintianzheng", ""); 
jyx2_ReplaceSceneObject("", "NPC/weiyixiao", ""); 
ModifyEvent(-2, 77, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|改变贴图为空。场景11-77
ModifyEvent(-2, 78, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|改变贴图为空。场景11-78
jyx2_ReplaceSceneObject("", "NPC/明教弟子77", "");
jyx2_ReplaceSceneObject("", "NPC/明教弟子78", "");
--明教弟子
ModifyEvent(-2, 85, 1, 1, 87, -1, -1, 5302, 5302, 5302, -2, -2, -2);--by fanyu|启动脚本-87改变对话，改变贴图。场景11-85
ModifyEvent(-2, 95, 1, 1, 87, -1, -1, 5302, 5302, 5302, -2, -2, -2);--by fanyu|启动脚本-87改变对话，改变贴图。场景11-95
ModifyEvent(-2, 86, 1, 1, 87, -1, -1, 5300, 5300, 5300, -2, -2, -2);--by fanyu|启动脚本-87改变对话，改变贴图。场景11-86
ModifyEvent(-2, 87, 1, 1, 87, -1, -1, 5300, 5300, 5300, -2, -2, -2);--by fanyu|启动脚本-87改变对话，改变贴图。场景11-87
ModifyEvent(-2, 88, 1, 1, 87, -1, -1, 5306, 5306, 5306, -2, -2, -2);--by fanyu|启动脚本-87改变对话，改变贴图。场景11-88
ModifyEvent(-2, 89, 1, 1, 87, -1, -1, 5306, 5306, 5306, -2, -2, -2);--by fanyu|启动脚本-87改变对话，改变贴图。场景11-89
jyx2_ReplaceSceneObject("", "NPC/明教弟子85", "1");
jyx2_ReplaceSceneObject("", "NPC/明教弟子95", "1");
jyx2_ReplaceSceneObject("", "NPC/明教弟子86", "1");
jyx2_ReplaceSceneObject("", "NPC/明教弟子87", "1");
jyx2_ReplaceSceneObject("", "NPC/明教弟子88", "1");
jyx2_ReplaceSceneObject("", "NPC/明教弟子89", "1");

ModifyEvent(-2, 90, 1, 1, 88, -1, -1, 5334, 5334, 5334, -2, -2, -2);--by fanyu|启动脚本-88改变对话，改变贴图。场景11-90
ModifyEvent(-2, 91, 1, 1, 84, -1, -1, 5318, 5318, 5318, -2, -2, -2);--by fanyu|启动脚本-84改变对话，改变贴图。场景11-91
ModifyEvent(-2, 92, 1, 1, 85, -1, -1, 5324, 5324, 5324, -2, -2, -2);--by fanyu|启动脚本-85改变对话，改变贴图。场景11-92
ModifyEvent(-2, 93, 1, 1, 83, -1, -1, 5342, 5342, 5342, -2, -2, -2);--by fanyu|启动脚本-83改变对话，改变贴图。场景11-93
jyx2_ReplaceSceneObject("", "NPC/范遥90", "1");
jyx2_ReplaceSceneObject("", "NPC/殷天正91", "1");
jyx2_ReplaceSceneObject("", "NPC/韦一笑92", "1");
jyx2_ReplaceSceneObject("", "NPC/杨逍93", "1");
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
--崆峒
ModifyEvent(34, 0, -2, -2, 130, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-130。场景34-0
ModifyEvent(34, 1, -2, -2, 129, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-129。场景34-1
ModifyEvent(34, 2, -2, -2, 129, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-129。场景34-2
ModifyEvent(34, 3, -2, -2, 129, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-129。场景34-3
ModifyEvent(34, 4, -2, -2, 129, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-129。场景34-4
ModifyEvent(34, 5, -2, -2, 129, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-129。场景34-5
ModifyEvent(34, 6, -2, -2, 129, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-129。场景34-6
ModifyEvent(34, 7, -2, -2, 129, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-129。场景34-7
--昆仑
ModifyEvent(68, 3, -2, -2, 140, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-140。场景68-3
ModifyEvent(68, 4, -2, -2, 140, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-140。场景68-4
ModifyEvent(68, 5, -2, -2, 140, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-140。场景68-5
ModifyEvent(68, 6, -2, -2, 140, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-140。场景68-6
ModifyEvent(68, 7, -2, -2, 141, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-141。场景68-7
--峨嵋
ModifyEvent(33, 0, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(33, 1, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(33, 2, -2, -2, 148, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-148。场景33-2
ModifyEvent(33, 3, -2, -2, 150, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-150。场景33-3
ModifyEvent(33, 4, -2, -2, 150, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-150。场景33-4
ModifyEvent(33, 5, -2, -2, 150, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-150。场景33-5
ModifyEvent(33, 6, -2, -2, 150, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-150。场景33-6
ModifyEvent(33, 7, -2, -2, 150, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-150。场景33-7
ModifyEvent(33, 8, -2, -2, 150, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-150。场景33-8
ModifyEvent(33, 9, -2, -2, 150, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-150。场景33-9
ModifyEvent(33, 10, -2, -2, 150, -2, -2, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-150。场景33-10
--龙门客栈
ModifyEvent(60, 0, -2, -2, 574, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-574。场景60-0
ModifyEvent(60, 1, -2, -2, 575, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-575。场景60-1
ModifyEvent(60, 4, -2, -2, 576, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-576。场景60-4
ModifyEvent(60, 5, -2, -2, 576, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-576。场景60-5
ModifyEvent(60, 7, -2, -2, 577, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-577。场景60-7
ModifyEvent(60, 8, -2, -2, 577, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-577。场景60-8
ModifyEvent(60, 9, -2, -2, 577, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-577。场景60-9
--少林
ModifyEvent(28, 3, -2, -2, 508, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-508。场景26-3
ModifyEvent(28, 4, -2, -2, 508, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-508。场景26-4
ModifyEvent(28, 5, -2, -2, 508, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-508。场景26-5
ModifyEvent(28, 6, -2, -2, 508, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本-508。场景26-6
do return end;
