ModifyEvent(-2, 2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 3, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
SetScenceMap(-2, 1, 26, 34, 4738);--by fanyu|改变坐标，更改贴图。场景20-编号1
SetScenceMap(-2, 1, 26, 31, 4738);--by fanyu|改变坐标，更改贴图。场景20-编号1
SetScenceMap(-2, 1, 26, 26, 4738);--by fanyu|改变坐标，更改贴图。场景20-编号1
SetScenceMap(-2, 1, 26, 23, 4738);--by fanyu|改变坐标，更改贴图。场景20-编号1
SetScenceMap(-2, 1, 27, 34, 4740);--by fanyu|改变坐标，更改贴图。场景20-编号1
SetScenceMap(-2, 1, 27, 31, 4740);--by fanyu|改变坐标，更改贴图。场景20-编号1
SetScenceMap(-2, 1, 27, 26, 4740);--by fanyu|改变坐标，更改贴图。场景20-编号1
SetScenceMap(-2, 1, 27, 23, 4740);--by fanyu|改变坐标，更改贴图。场景20-编号1
jyx2_ReplaceSceneObject("","Dynamic/beeBox","1");
ModifyEvent(-2, 5, 1, 1, 409, -1, -1, 6256, 6262, 6256, -2, -2, -2);--by fanyu|更改贴图，启动409脚本。场景20-编号5
ModifyEvent(-2, 6, 1, 1, 409, -1, -1, 6256, 6262, 6256, -2, -2, -2);--by fanyu|更改贴图，启动409脚本。场景20-编号6
ModifyEvent(-2, 7, 1, 1, 409, -1, -1, 6256, 6262, 6256, -2, -2, -2);--by fanyu|更改贴图，启动409脚本。场景20-编号7
ModifyEvent(-2, 8, 1, 1, 409, -1, -1, 6256, 6262, 6256, -2, -2, -2);--by fanyu|更改贴图，启动409脚本。场景20-编号8
ModifyEvent(-2, 9, 1, 1, 409, -1, -1, 6256, 6262, 6256, -2, -2, -2);--by fanyu|更改贴图，启动409脚本。场景20-编号9
ModifyEvent(-2, 10, 1, 1, 409, -1, -1, 6256, 6262, 6256, -2, -2, -2);--by fanyu|更改贴图，启动409脚本。场景20-编号10
ModifyEvent(-2, 11, 1, 1, 409, -1, -1, 6256, 6262, 6256, -2, -2, -2);--by fanyu|更改贴图，启动409脚本。场景20-编号11
ModifyEvent(-2, 12, 1, 1, 409, -1, -1, 6256, 6262, 6256, -2, -2, -2);--by fanyu|更改贴图，启动409脚本。场景20-编号12
do return end;
