Talk(110, "这位少侠，是想来我们莫桥山庄习武的吗？");
Talk(0, "我……我只是想打听一下莫穿林掌门的死因。");
Talk(110, "你是什么人？为何打听这件事儿？");
Talk(0, "我是……我是莫大侠的崇拜者，突然听说他去世了，觉得很好奇，就来打听打听。");
Talk(110, "原来是这样，莫师父他……哎，说来也是蹊跷，九月初五那晚，<color=orange>莫师父和其他三大门派的掌门人一同在怡麟楼喝酒</color>，回来之后就无缘无故的死去了……");
Talk(0, "那天晚上他是独自一人回家的吗？");
Talk(110, "那天他是和金露师娘一起去赴宴的，听师娘说，<color=orange>她在酒宴后自己去水果摊购置雪梨了</color>，没有同师父一路回家，师娘为这件事情很懊悔，这几天郁郁寡欢，都很少见着她。");
Talk(0, "是这样啊，张大侠有去调查莫掌门的死因吗？目前有什么线索了吗？");
Talk(110, "掌门死后，莫桥山庄的众弟子们大都心神不宁，我这几天主要在山庄里稳定局面，调查师父死因的事情专门委派了朱云天师弟负责。");
Talk(100, "额……云贤啊云贤，你交给那个傻头傻脑的朱云天，怎么查得出我的死因。");
Talk(0, "那谢谢了，我去找朱大侠聊聊。");
ModifyEvent(-2, -2, -2, -2, 12, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, 19, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 0, -2, -2, 112, -1, -1, -2, -2, -2, -2, -2, -2);--水果摊，张老板，B
do return end;
