Talk(0, "张老板，想跟您打听个事儿。");
Talk(1110, "什么事？");
Talk(0, "不知您记不记得，这个月初五晚上，莫桥山庄莫掌门的夫人是不是到店里来买过槟榔啊？");
Talk(1110, "噢~您说的是那位貌美如花、身材娇好的金露夫人呀！");
Talk(0, "额，老板你干嘛突然这么激动。");
Talk(1110, "我一想起金夫人的姿色就有点……嘿嘿。");
Talk(0, "看来你对她印象很深。");
Talk(1110, "是的，是很深，我看过。");
Talk(0, "？");
Talk(1110, "不过你说这个月初五晚上，她还真没来过。");
Talk(0, "你确定那天晚上她没来过？");
Talk(1110, "是的，前几次来买槟榔都是在白天，阳光下……正好能看到她深深的乳沟。");
Talk(100, "（尼玛）……");
ModifyEvent(-2, -2, -2, -2, 111, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(2, 6, -2, -2, 0, -1, -1, -2, -2, -2, -2, -2, -2);--碧玉头盔条件之一
do return end;
