if InTeam(11) == true then goto label0 end;
    Talk(1191, "我爹马上要举行比武招亲了，也不知我会嫁给什么样的人，真希望是一位的兼资文武、品貌不凡的公子。");
    do return end;
::label0::
    jyx2_ReplaceSceneObject("", "NPC/朱云天", "1");
    Talk(1191, "我爹马上要举行比武招亲了，也不知我会嫁给什么样的人，真希望是一位的兼资文武、品貌不凡的公子。");
    Talk(11, "杨姑娘真是太美了。");
    Talk(1191, "原来是莫桥山庄的朱公子，你也会参加比武招亲吗？");
    Talk(11, "我。。。赢了就能娶你是吗？");
    Talk(1191, "嘻嘻，是呢，因为爹想找个武艺高强的郎君来保护我。");
    Talk(11, "那。。。我还真想试试。");
    Talk(1191, "那朱公子，要加油哦。");
    Talk(11, "好！好！");
    Talk(0, "你的脸怎么红得像红烧猪蹄一样？");
    Talk(11, "好！好！");
    jyx2_ReplaceSceneObject("", "NPC/朱云天", "");
    ModifyEvent(-2, -2, -2, -2, 194, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
