if InTeam(11) == true then goto label0 end;
    Talk(60, "闲杂人等请回避！");
    do return end;
::label0::
    Talk(0, "参见王将军！");
    Talk(60, "阁下是？");
    Talk(11, "王将军，我是莫桥山庄莫传林的三弟子朱云天，这位是陶六一，我们正在调查莫掌门的死因，特来请将军指点迷津。");
    Talk(60, "原来是为莫掌门的事而来。");
    Talk(0, "正是！");
    Talk(60, "得渡城者得天下，蓝隼国已经很清晰的认识到这个局势。这些年来我坚守此城责任重大，莫掌门帮了我不少忙，我本来想在月中举行武林大会，而莫掌门正是我心目中盟主的最佳人选，没想到…………哎，失去了莫掌门等于我王远断掉了一只手臂。");
    Talk(0, "我们一定努力找出莫穿林掌门的死因。");
    Talk(60, "我现在更关心谁能胜任盟主这一位置。");
    ModifyEvent(-2, -2, -2, -2, 65, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
