if InTeam(90) == true then goto label0 end;
    Talk(91, "你还想怎么样。");
    do return end;
::label0::
    Talk(91, "你带着我女儿到处乱跑，把她弄丢了我可要宰了你。");
    Talk(90, "放心吧爹爹，女儿长大了。");
    Talk(91, "别忘了找找你娘的下落。");
    Talk(90, "都找了八年了，要活着早就找到了。");
    Talk(91, "我打死你这丫头！");
    Talk(0, "妞妞的母亲去哪儿了？");
    Talk(90, "八年前的一天晚上娘和爹吵了一架，就再也没有回来过了，整个人在世上消失了一般。");
    Talk(0, "这样吗？");
    Talk(90, "是的，所以我一直说让六一哥哥带我到江湖上去游玩，其实内心里是想去寻找娘亲的下落。");
    Talk(0, "那好，既然我们都有要寻找的东西，就一起吧！");
    SetFlagInt("牛不三交谈", 1);
    ModifyEvent(-2, -2, -2, -2, 99, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
